[Killed] BlockStatement
src/link-sharing.ts:36:50
  *
  * @returns 32-byte random secret for share link
  */
-export function generateLinkSecret(): Uint8Array {
-  return randomBytes(LINK_SECRET_SIZE);
-}
+export function generateLinkSecret(): Uint8Array {}
 
 /**
killedBy: link-sharing generateLinkSecret generates 32-byte random secret
statusReason: expected undefined to be an instance of Uint8Array

[Killed] BlockStatement
src/link-sharing.ts:49:66
  * @param linkSecret - 32-byte secret from URL fragment
  * @returns Object with linkId (16 bytes) and wrappingKey (32 bytes)
  */
-export function deriveLinkKeys(linkSecret: Uint8Array): LinkKeys {
-  if (linkSecret.length !== LINK_SECRET_SIZE) {
-    throw new Error(
-      `Link secret must be ${LINK_SECRET_SIZE} bytes, got ${linkSecret.length}`
-    );
-  }
-
-  // Derive 16-byte link ID using BLAKE2b HKDF-style
-  const linkId = sodium.crypto_generichash(LINK_ID_SIZE, LINK_ID_CONTEXT, linkSecret);
-
-  // Derive 32-byte wrapping key using BLAKE2b HKDF-style
-  const wrappingKey = sodium.crypto_generichash(KEY_SIZE, LINK_WRAP_CONTEXT, linkSecret);
-
-  return { linkId, wrappingKey };
-}
+export function deriveLinkKeys(linkSecret: Uint8Array): LinkKeys {}
 
 /**
killedBy: link-sharing deriveLinkKeys derives linkId and wrappingKey from secret
statusReason: Cannot read properties of undefined (reading 'linkId')

[Killed] ConditionalExpression
src/link-sharing.ts:50:7
  * @returns Object with linkId (16 bytes) and wrappingKey (32 bytes)
  */
 export function deriveLinkKeys(linkSecret: Uint8Array): LinkKeys {
-  if (linkSecret.length !== LINK_SECRET_SIZE) {
+  if (false) {
     throw new Error(
       `Link secret must be ${LINK_SECRET_SIZE} bytes, got ${linkSecret.length}`
killedBy: link-sharing deriveLinkKeys rejects invalid secret length
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/link-sharing.ts:50:7
  * @returns Object with linkId (16 bytes) and wrappingKey (32 bytes)
  */
 export function deriveLinkKeys(linkSecret: Uint8Array): LinkKeys {
-  if (linkSecret.length !== LINK_SECRET_SIZE) {
+  if (linkSecret.length === LINK_SECRET_SIZE) {
     throw new Error(
       `Link secret must be ${LINK_SECRET_SIZE} bytes, got ${linkSecret.length}`
killedBy: link-sharing deriveLinkKeys derives linkId and wrappingKey from secret
statusReason: Link secret must be 32 bytes, got 32

[Killed] BlockStatement
src/link-sharing.ts:80:19
   tierKey: Uint8Array,
   tier: AccessTier,
   wrappingKey: Uint8Array
-): WrappedTierKey {
-  if (wrappingKey.length !== KEY_SIZE) {
-    throw new Error(`Wrapping key must be ${KEY_SIZE} bytes, got ${wrappingKey.length}`);
-  }
-  if (tierKey.length !== KEY_SIZE) {
-    throw new Error(`Tier key must be ${KEY_SIZE} bytes, got ${tierKey.length}`);
-  }
-
-  // Wrap the tier key
-  const wrappedKey = wrapKey(tierKey, wrappingKey);
-
-  return {
-    tier,
-    nonce: wrappedKey.subarray(0, 24),
-    encryptedKey: wrappedKey.subarray(24),
-  };
-}
+): WrappedTierKey {}
 
 /**
killedBy: link-sharing wrapTierKeyForLink / unwrapTierKeyFromLink round-trips tier key wrapping
statusReason: Cannot read properties of undefined (reading 'tier')

[Killed] ConditionalExpression
src/link-sharing.ts:81:7
   tier: AccessTier,
   wrappingKey: Uint8Array
 ): WrappedTierKey {
-  if (wrappingKey.length !== KEY_SIZE) {
+  if (true) {
     throw new Error(`Wrapping key must be ${KEY_SIZE} bytes, got ${wrappingKey.length}`);
   }
killedBy: link-sharing wrapTierKeyForLink / unwrapTierKeyFromLink round-trips tier key wrapping
statusReason: Wrapping key must be 32 bytes, got 32

[Killed] BlockStatement
src/link-sharing.ts:81:40
   tier: AccessTier,
   wrappingKey: Uint8Array
 ): WrappedTierKey {
-  if (wrappingKey.length !== KEY_SIZE) {
-    throw new Error(`Wrapping key must be ${KEY_SIZE} bytes, got ${wrappingKey.length}`);
-  }
+  if (wrappingKey.length !== KEY_SIZE) {}
   if (tierKey.length !== KEY_SIZE) {
     throw new Error(`Tier key must be ${KEY_SIZE} bytes, got ${tierKey.length}`);
killedBy: link-sharing mutation testing - killing surviving mutants wrapTierKeyForLink validation edge cases (spy-based) throws before calling wrapKey when wrapping key is invalid length
statusReason: expected [Function] to throw error including 'Wrapping key must be 32 bytes' but got 'Wrapper key must be 32 bytes, got 31'

[Killed] ConditionalExpression
src/link-sharing.ts:84:7
   if (wrappingKey.length !== KEY_SIZE) {
     throw new Error(`Wrapping key must be ${KEY_SIZE} bytes, got ${wrappingKey.length}`);
   }
-  if (tierKey.length !== KEY_SIZE) {
+  if (true) {
     throw new Error(`Tier key must be ${KEY_SIZE} bytes, got ${tierKey.length}`);
   }
killedBy: link-sharing wrapTierKeyForLink / unwrapTierKeyFromLink round-trips tier key wrapping
statusReason: Tier key must be 32 bytes, got 32

[Killed] EqualityOperator
src/link-sharing.ts:84:7
   if (wrappingKey.length !== KEY_SIZE) {
     throw new Error(`Wrapping key must be ${KEY_SIZE} bytes, got ${wrappingKey.length}`);
   }
-  if (tierKey.length !== KEY_SIZE) {
+  if (tierKey.length === KEY_SIZE) {
     throw new Error(`Tier key must be ${KEY_SIZE} bytes, got ${tierKey.length}`);
   }
killedBy: link-sharing wrapTierKeyForLink / unwrapTierKeyFromLink round-trips tier key wrapping
statusReason: Tier key must be 32 bytes, got 32

[Killed] BlockStatement
src/link-sharing.ts:113:21
   tierKeys: { thumbKey: Uint8Array; previewKey: Uint8Array; fullKey: Uint8Array },
   accessTier: AccessTier,
   wrappingKey: Uint8Array
-): WrappedTierKey[] {
-  const results: WrappedTierKey[] = [];
-
-  // Always include thumb key
-  results.push(wrapTierKeyForLink(tierKeys.thumbKey, AccessTier.THUMB, wrappingKey));
-
-  // Include preview key if tier allows
-  if (accessTier >= AccessTier.PREVIEW) {
-    results.push(wrapTierKeyForLink(tierKeys.previewKey, AccessTier.PREVIEW, wrappingKey));
-  }
-
-  // Include full key if tier allows
-  if (accessTier >= AccessTier.FULL) {
-    results.push(wrapTierKeyForLink(tierKeys.fullKey, AccessTier.FULL, wrappingKey));
-  }
-
-  return results;
-}
+): WrappedTierKey[] {}
 
 /**
killedBy: link-sharing wrapAllTierKeysForLink wraps keys up to specified access tier
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
src/link-sharing.ts:120:7
   results.push(wrapTierKeyForLink(tierKeys.thumbKey, AccessTier.THUMB, wrappingKey));
 
   // Include preview key if tier allows
-  if (accessTier >= AccessTier.PREVIEW) {
+  if (accessTier > AccessTier.PREVIEW) {
     results.push(wrapTierKeyForLink(tierKeys.previewKey, AccessTier.PREVIEW, wrappingKey));
   }
killedBy: link-sharing wrapAllTierKeysForLink wraps keys up to specified access tier
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BlockStatement
src/link-sharing.ts:120:41
   results.push(wrapTierKeyForLink(tierKeys.thumbKey, AccessTier.THUMB, wrappingKey));
 
   // Include preview key if tier allows
-  if (accessTier >= AccessTier.PREVIEW) {
-    results.push(wrapTierKeyForLink(tierKeys.previewKey, AccessTier.PREVIEW, wrappingKey));
-  }
+  if (accessTier >= AccessTier.PREVIEW) {}
 
   // Include full key if tier allows
killedBy: link-sharing wrapAllTierKeysForLink wraps keys up to specified access tier
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/link-sharing.ts:125:7
   }
 
   // Include full key if tier allows
-  if (accessTier >= AccessTier.FULL) {
+  if (false) {
     results.push(wrapTierKeyForLink(tierKeys.fullKey, AccessTier.FULL, wrappingKey));
   }
killedBy: link-sharing wrapAllTierKeysForLink wraps keys up to specified access tier
statusReason: expected 2 to be 3 // Object.is equality

[Killed] BlockStatement
src/link-sharing.ts:125:38
   }
 
   // Include full key if tier allows
-  if (accessTier >= AccessTier.FULL) {
-    results.push(wrapTierKeyForLink(tierKeys.fullKey, AccessTier.FULL, wrappingKey));
-  }
+  if (accessTier >= AccessTier.FULL) {}
 
   return results;
killedBy: link-sharing wrapAllTierKeysForLink wraps keys up to specified access tier
statusReason: expected 2 to be 3 // Object.is equality

[Killed] BlockStatement
src/link-sharing.ts:144:15
   wrapped: WrappedTierKey,
   tier: AccessTier,
   wrappingKey: Uint8Array
-): Uint8Array {
-  if (wrapped.tier !== tier) {
-    throw new Error(`Tier mismatch: expected ${tier}, got ${wrapped.tier}`);
-  }
-
-  // Reconstruct the full wrapped key (nonce || ciphertext)
-  const fullWrapped = new Uint8Array(wrapped.nonce.length + wrapped.encryptedKey.length);
-  fullWrapped.set(wrapped.nonce, 0);
-  fullWrapped.set(wrapped.encryptedKey, wrapped.nonce.length);
-
-  return unwrapKey(fullWrapped, wrappingKey);
-}
+): Uint8Array {}
 
 /**
killedBy: link-sharing wrapTierKeyForLink / unwrapTierKeyFromLink round-trips tier key wrapping
statusReason: expected undefined to deeply equal Uint8Array[ 27, 184, 233, 173, …(-7) ]

[Killed] EqualityOperator
src/link-sharing.ts:145:7
   tier: AccessTier,
   wrappingKey: Uint8Array
 ): Uint8Array {
-  if (wrapped.tier !== tier) {
+  if (wrapped.tier === tier) {
     throw new Error(`Tier mismatch: expected ${tier}, got ${wrapped.tier}`);
   }
killedBy: link-sharing wrapTierKeyForLink / unwrapTierKeyFromLink round-trips tier key wrapping
statusReason: Tier mismatch: expected 1, got 1

[Killed] BlockStatement
src/link-sharing.ts:145:30
   tier: AccessTier,
   wrappingKey: Uint8Array
 ): Uint8Array {
-  if (wrapped.tier !== tier) {
-    throw new Error(`Tier mismatch: expected ${tier}, got ${wrapped.tier}`);
-  }
+  if (wrapped.tier !== tier) {}
 
   // Reconstruct the full wrapped key (nonce || ciphertext)
killedBy: link-sharing wrapTierKeyForLink / unwrapTierKeyFromLink fails to unwrap with wrong tier
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/link-sharing.ts:146:21
   wrappingKey: Uint8Array
 ): Uint8Array {
   if (wrapped.tier !== tier) {
-    throw new Error(`Tier mismatch: expected ${tier}, got ${wrapped.tier}`);
+    throw new Error(``);
   }
 
killedBy: link-sharing wrapTierKeyForLink / unwrapTierKeyFromLink fails to unwrap with wrong tier
statusReason: expected [Function] to throw error including 'mismatch' but got ''

[Killed] ArithmeticOperator
src/link-sharing.ts:150:38
   }
 
   // Reconstruct the full wrapped key (nonce || ciphertext)
-  const fullWrapped = new Uint8Array(wrapped.nonce.length + wrapped.encryptedKey.length);
+  const fullWrapped = new Uint8Array(wrapped.nonce.length - wrapped.encryptedKey.length);
   fullWrapped.set(wrapped.nonce, 0);
   fullWrapped.set(wrapped.encryptedKey, wrapped.nonce.length);
killedBy: link-sharing wrapTierKeyForLink / unwrapTierKeyFromLink round-trips tier key wrapping
statusReason: Invalid typed array length: -24

[Killed] BlockStatement
src/link-sharing.ts:163:66
  * @param linkSecret - 32-byte secret
  * @returns Base64url encoded string (no padding)
  */
-export function encodeLinkSecret(linkSecret: Uint8Array): string {
-  return sodium.to_base64(linkSecret, sodium.base64_variants.URLSAFE_NO_PADDING);
-}
+export function encodeLinkSecret(linkSecret: Uint8Array): string {}
 
 /**
killedBy: link-sharing encodeLinkSecret / decodeLinkSecret round-trips secret through base64url
statusReason: input cannot be null or undefined

[Killed] BlockStatement
src/link-sharing.ts:173:63
  * @param encoded - Base64url encoded string
  * @returns 32-byte link secret
  */
-export function decodeLinkSecret(encoded: string): Uint8Array {
-  const decoded = sodium.from_base64(encoded, sodium.base64_variants.URLSAFE_NO_PADDING);
-  if (decoded.length !== LINK_SECRET_SIZE) {
-    throw new Error(
-      `Invalid link secret length: expected ${LINK_SECRET_SIZE}, got ${decoded.length}`
-    );
-  }
-  return decoded;
-}
+export function decodeLinkSecret(encoded: string): Uint8Array {}
 
 /**
killedBy: link-sharing encodeLinkSecret / decodeLinkSecret round-trips secret through base64url
statusReason: expected undefined to deeply equal Uint8Array[ 60, 101, 19, 4, 237, …(-107) ]

[Killed] ConditionalExpression
src/link-sharing.ts:175:7
  */
 export function decodeLinkSecret(encoded: string): Uint8Array {
   const decoded = sodium.from_base64(encoded, sodium.base64_variants.URLSAFE_NO_PADDING);
-  if (decoded.length !== LINK_SECRET_SIZE) {
+  if (true) {
     throw new Error(
       `Invalid link secret length: expected ${LINK_SECRET_SIZE}, got ${decoded.length}`
killedBy: link-sharing encodeLinkSecret / decodeLinkSecret round-trips secret through base64url
statusReason: Invalid link secret length: expected 32, got 32

[Killed] ConditionalExpression
src/link-sharing.ts:175:7
  */
 export function decodeLinkSecret(encoded: string): Uint8Array {
   const decoded = sodium.from_base64(encoded, sodium.base64_variants.URLSAFE_NO_PADDING);
-  if (decoded.length !== LINK_SECRET_SIZE) {
+  if (false) {
     throw new Error(
       `Invalid link secret length: expected ${LINK_SECRET_SIZE}, got ${decoded.length}`
killedBy: link-sharing encodeLinkSecret / decodeLinkSecret rejects wrong length after decode
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/link-sharing.ts:189:58
  * @param linkId - 16-byte link ID
  * @returns Base64url encoded string (no padding)
  */
-export function encodeLinkId(linkId: Uint8Array): string {
-  return sodium.to_base64(linkId, sodium.base64_variants.URLSAFE_NO_PADDING);
-}
+export function encodeLinkId(linkId: Uint8Array): string {}
 
 /**
killedBy: link-sharing createShareLinkUrl / parseShareLinkUrl round-trips through URL creation/parsing
statusReason: expected null not to be null

[Killed] BlockStatement
src/link-sharing.ts:199:59
  * @param encoded - Base64url encoded string
  * @returns 16-byte link ID
  */
-export function decodeLinkId(encoded: string): Uint8Array {
-  const decoded = sodium.from_base64(encoded, sodium.base64_variants.URLSAFE_NO_PADDING);
-  if (decoded.length !== LINK_ID_SIZE) {
-    throw new Error(
-      `Invalid link ID length: expected ${LINK_ID_SIZE}, got ${decoded.length}`
-    );
-  }
-  return decoded;
-}
+export function decodeLinkId(encoded: string): Uint8Array {}
 
 /**
killedBy: link-sharing createShareLinkUrl / parseShareLinkUrl round-trips through URL creation/parsing
statusReason: expected null not to be null

[Killed] BlockStatement
src/link-sharing.ts:201:40
  */
 export function decodeLinkId(encoded: string): Uint8Array {
   const decoded = sodium.from_base64(encoded, sodium.base64_variants.URLSAFE_NO_PADDING);
-  if (decoded.length !== LINK_ID_SIZE) {
-    throw new Error(
-      `Invalid link ID length: expected ${LINK_ID_SIZE}, got ${decoded.length}`
-    );
-  }
+  if (decoded.length !== LINK_ID_SIZE) {}
   return decoded;
 }
killedBy: link-sharing mutation testing - killing surviving mutants decodeLinkId validation error message in decodeLinkId includes expected and actual length
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/link-sharing.ts:201:7
  */
 export function decodeLinkId(encoded: string): Uint8Array {
   const decoded = sodium.from_base64(encoded, sodium.base64_variants.URLSAFE_NO_PADDING);
-  if (decoded.length !== LINK_ID_SIZE) {
+  if (false) {
     throw new Error(
       `Invalid link ID length: expected ${LINK_ID_SIZE}, got ${decoded.length}`
killedBy: link-sharing mutation testing - killing surviving mutants decodeLinkId validation error message in decodeLinkId includes expected and actual length
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/link-sharing.ts:218:85
  * @param linkSecret - 32-byte link secret
  * @returns Complete shareable URL
  */
-export function createShareLinkUrl(baseUrl: string, linkSecret: Uint8Array): string {
-  const { linkId } = deriveLinkKeys(linkSecret);
-  const encodedLinkId = encodeLinkId(linkId);
-  const encodedSecret = encodeLinkSecret(linkSecret);
-
-  // Remove trailing slash from base URL if present
-  const normalizedBase = baseUrl.replace(/\/$/, '');
-
-  return `${normalizedBase}/s/${encodedLinkId}#k=${encodedSecret}`;
-}
+export function createShareLinkUrl(baseUrl: string, linkSecret: Uint8Array): string {}
 
 /**
killedBy: link-sharing createShareLinkUrl / parseShareLinkUrl creates valid share URL
statusReason: .toMatch() expects to receive a string, but got undefined

[Killed] Regex
src/link-sharing.ts:224:42
   const encodedSecret = encodeLinkSecret(linkSecret);
 
   // Remove trailing slash from base URL if present
-  const normalizedBase = baseUrl.replace(/\/$/, '');
+  const normalizedBase = baseUrl.replace(/\//, '');
 
   return `${normalizedBase}/s/${encodedLinkId}#k=${encodedSecret}`;
killedBy: link-sharing createShareLinkUrl / parseShareLinkUrl creates valid share URL
statusReason: expected 'https:/photos.example.com/s/Ez-VS_cSs…' to match /^https:\/\/photos\.example\.com\/s\/…/\

[Killed] StringLiteral
src/link-sharing.ts:226:10
   // Remove trailing slash from base URL if present
   const normalizedBase = baseUrl.replace(/\/$/, '');
 
-  return `${normalizedBase}/s/${encodedLinkId}#k=${encodedSecret}`;
+  return ``;
 }
 
killedBy: link-sharing createShareLinkUrl / parseShareLinkUrl creates valid share URL
statusReason: expected '' to match /^https:\/\/photos\.example\.com\/s\/…/\

[Killed] Regex
src/link-sharing.ts:243:45
     const parsed = new URL(url);
 
     // Extract link ID from path: .../s/{linkId} (supports prefix paths)
-    const pathMatch = parsed.pathname.match(/\/s\/([A-Za-z0-9_-]+)$/);
+    const pathMatch = parsed.pathname.match(/\/s\/([A-Za-z0-9_-]+)/);
     // Stryker disable next-line ConditionalExpression,LogicalOperator,BlockStatement: Guard is semantically equivalent - mutation causes exception caught by try-catch, producing same null result
     if (!pathMatch || !pathMatch[1]) {
killedBy: link-sharing mutation testing - killing surviving mutants parseShareLinkUrl regex anchoring rejects URL with /s/ in middle of path (not at end)
statusReason: expected { …(2) } to be null

[Killed] BooleanLiteral
src/link-sharing.ts:245:9
     // Extract link ID from path: .../s/{linkId} (supports prefix paths)
     const pathMatch = parsed.pathname.match(/\/s\/([A-Za-z0-9_-]+)$/);
     // Stryker disable next-line ConditionalExpression,LogicalOperator,BlockStatement: Guard is semantically equivalent - mutation causes exception caught by try-catch, producing same null result
-    if (!pathMatch || !pathMatch[1]) {
+    if (pathMatch || !pathMatch[1]) {
       return null;
     }
killedBy: link-sharing createShareLinkUrl / parseShareLinkUrl round-trips through URL creation/parsing
statusReason: expected null not to be null

[Killed] BooleanLiteral
src/link-sharing.ts:245:23
     // Extract link ID from path: .../s/{linkId} (supports prefix paths)
     const pathMatch = parsed.pathname.match(/\/s\/([A-Za-z0-9_-]+)$/);
     // Stryker disable next-line ConditionalExpression,LogicalOperator,BlockStatement: Guard is semantically equivalent - mutation causes exception caught by try-catch, producing same null result
-    if (!pathMatch || !pathMatch[1]) {
+    if (!pathMatch || pathMatch[1]) {
       return null;
     }
killedBy: link-sharing createShareLinkUrl / parseShareLinkUrl round-trips through URL creation/parsing
statusReason: expected null not to be null

[Killed] Regex
src/link-sharing.ts:252:40
 
     // Extract link secret from fragment: #k={linkSecret}
     const fragment = parsed.hash;
-    const secretMatch = fragment.match(/^#k=([A-Za-z0-9_-]+)$/);
+    const secretMatch = fragment.match(/^#k=([^A-Za-z0-9_-]+)$/);
     // Stryker disable next-line ConditionalExpression,LogicalOperator,BlockStatement: Guard is semantically equivalent - mutation causes exception caught by try-catch, producing same null result
     if (!secretMatch || !secretMatch[1]) {
killedBy: link-sharing createShareLinkUrl / parseShareLinkUrl round-trips through URL creation/parsing
statusReason: expected null not to be null

[Killed] Regex
src/link-sharing.ts:252:40
 
     // Extract link secret from fragment: #k={linkSecret}
     const fragment = parsed.hash;
-    const secretMatch = fragment.match(/^#k=([A-Za-z0-9_-]+)$/);
+    const secretMatch = fragment.match(/#k=([A-Za-z0-9_-]+)$/);
     // Stryker disable next-line ConditionalExpression,LogicalOperator,BlockStatement: Guard is semantically equivalent - mutation causes exception caught by try-catch, producing same null result
     if (!secretMatch || !secretMatch[1]) {
killedBy: link-sharing mutation testing - killing surviving mutants parseShareLinkUrl fragment guard edge cases rejects fragment with leading content before #k= (kills ^ anchor removal)
statusReason: expected { …(2) } to be null

[Killed] BooleanLiteral
src/link-sharing.ts:254:25
     const fragment = parsed.hash;
     const secretMatch = fragment.match(/^#k=([A-Za-z0-9_-]+)$/);
     // Stryker disable next-line ConditionalExpression,LogicalOperator,BlockStatement: Guard is semantically equivalent - mutation causes exception caught by try-catch, producing same null result
-    if (!secretMatch || !secretMatch[1]) {
+    if (!secretMatch || secretMatch[1]) {
       return null;
     }
killedBy: link-sharing createShareLinkUrl / parseShareLinkUrl round-trips through URL creation/parsing
statusReason: expected null not to be null

[Killed] BooleanLiteral
src/link-sharing.ts:254:9
     const fragment = parsed.hash;
     const secretMatch = fragment.match(/^#k=([A-Za-z0-9_-]+)$/);
     // Stryker disable next-line ConditionalExpression,LogicalOperator,BlockStatement: Guard is semantically equivalent - mutation causes exception caught by try-catch, producing same null result
-    if (!secretMatch || !secretMatch[1]) {
+    if (secretMatch || !secretMatch[1]) {
       return null;
     }
killedBy: link-sharing createShareLinkUrl / parseShareLinkUrl round-trips through URL creation/parsing
statusReason: expected null not to be null

[Killed] BooleanLiteral
src/link-sharing.ts:261:9
 
     // Verify linkId matches derived value
     const { linkId: derivedLinkId } = deriveLinkKeys(linkSecret);
-    if (!sodium.memcmp(linkId, derivedLinkId)) {
+    if (sodium.memcmp(linkId, derivedLinkId)) {
       return null; // linkId doesn't match secret - tampered or invalid
     }
killedBy: link-sharing createShareLinkUrl / parseShareLinkUrl round-trips through URL creation/parsing
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/link-sharing.ts:261:9
 
     // Verify linkId matches derived value
     const { linkId: derivedLinkId } = deriveLinkKeys(linkSecret);
-    if (!sodium.memcmp(linkId, derivedLinkId)) {
+    if (false) {
       return null; // linkId doesn't match secret - tampered or invalid
     }
killedBy: link-sharing createShareLinkUrl / parseShareLinkUrl returns null for tampered linkId that does not match secret
statusReason: expected { …(2) } to be null

[Killed] BlockStatement
src/link-sharing.ts:266:29
     }
 
     return { linkId, linkSecret };
-  } catch (_error: unknown) {
-    // Catch any parsing or validation errors
-    return null;
-  }
+  } catch (_error: unknown) {}
 }
 
killedBy: link-sharing createShareLinkUrl / parseShareLinkUrl returns null for URL with invalid linkId length
statusReason: expected undefined to be null
