[Killed] BlockStatement
src/envelope.ts:53:68
  * @param shardId - Shard index within photo
  * @returns 64-byte header
  */
-function buildHeader(epochId: number, shardId: number): Uint8Array {
-  const header = new Uint8Array(ENVELOPE_HEADER_SIZE);
-  const view = new DataView(header.buffer);
-
-  // Magic (4 bytes)
-  header.set(MAGIC_BYTES, OFFSET_MAGIC);
-
-  // Version (1 byte)
-  header[OFFSET_VERSION] = ENVELOPE_VERSION;
-
-  // EpochID (4 bytes, little-endian)
-  view.setUint32(OFFSET_EPOCH_ID, epochId, true);
-
-  // ShardID (4 bytes, little-endian)
-  view.setUint32(OFFSET_SHARD_ID, shardId, true);
-
-  // Nonce (24 bytes) - CRITICAL: always fresh random bytes
-  const nonce = sodium.randombytes_buf(NONCE_SIZE);
-  header.set(nonce, OFFSET_NONCE);
-
-  // Reserved (27 bytes) - already zeroed from Uint8Array constructor
-
-  return header;
-}
+function buildHeader(epochId: number, shardId: number): Uint8Array {}
 
 /**
killedBy: integration: album creation and photo upload encrypts and decrypts photo shards
statusReason: Cannot read properties of undefined (reading 'slice')

[Killed] BooleanLiteral
src/envelope.ts:64:44
   header[OFFSET_VERSION] = ENVELOPE_VERSION;
 
   // EpochID (4 bytes, little-endian)
-  view.setUint32(OFFSET_EPOCH_ID, epochId, true);
+  view.setUint32(OFFSET_EPOCH_ID, epochId, false);
 
   // ShardID (4 bytes, little-endian)
killedBy: envelope includes epochId and shardId in header
statusReason: expected 704643072 to be 42 // Object.is equality

[Killed] BooleanLiteral
src/envelope.ts:67:44
   view.setUint32(OFFSET_EPOCH_ID, epochId, true);
 
   // ShardID (4 bytes, little-endian)
-  view.setUint32(OFFSET_SHARD_ID, shardId, true);
+  view.setUint32(OFFSET_SHARD_ID, shardId, false);
 
   // Nonce (24 bytes) - CRITICAL: always fresh random bytes
killedBy: envelope includes epochId and shardId in header
statusReason: expected 117440512 to be 7 // Object.is equality

[Killed] ConditionalExpression
src/envelope.ts:86:7
  * @throws CryptoError if header is invalid
  */
 function parseHeader(envelope: Uint8Array): ShardHeader {
-  if (envelope.length < ENVELOPE_HEADER_SIZE) {
+  if (true) {
     throw new CryptoError(
       `Envelope too short: ${envelope.length} bytes, minimum ${ENVELOPE_HEADER_SIZE}`,
killedBy: integration: album creation and photo upload encrypts and decrypts photo shards
statusReason: Envelope too short: 1048656 bytes, minimum 64

[Killed] EqualityOperator
src/envelope.ts:86:7
  * @throws CryptoError if header is invalid
  */
 function parseHeader(envelope: Uint8Array): ShardHeader {
-  if (envelope.length < ENVELOPE_HEADER_SIZE) {
+  if (envelope.length >= ENVELOPE_HEADER_SIZE) {
     throw new CryptoError(
       `Envelope too short: ${envelope.length} bytes, minimum ${ENVELOPE_HEADER_SIZE}`,
killedBy: envelope round-trips encrypt/decrypt
statusReason: Envelope too short: 103 bytes, minimum 64

[Survived] MethodExpression
src/envelope.ts:93:18
     );
   }
 
-  const header = envelope.slice(0, ENVELOPE_HEADER_SIZE);
+  const header = envelope;
   const view = new DataView(header.buffer, header.byteOffset);
 

[Survived] ArithmeticOperator
src/envelope.ts:97:44
   const view = new DataView(header.buffer, header.byteOffset);
 
   // Validate magic
-  const magic = header.slice(OFFSET_MAGIC, OFFSET_MAGIC + 4);
+  const magic = header.slice(OFFSET_MAGIC, OFFSET_MAGIC - 4);
   for (let i = 0; i < 4; i++) {
     if (magic[i] !== MAGIC_BYTES[i]) {

[Survived] MethodExpression
src/envelope.ts:97:17
   const view = new DataView(header.buffer, header.byteOffset);
 
   // Validate magic
-  const magic = header.slice(OFFSET_MAGIC, OFFSET_MAGIC + 4);
+  const magic = header;
   for (let i = 0; i < 4; i++) {
     if (magic[i] !== MAGIC_BYTES[i]) {

[Survived] ConditionalExpression
src/envelope.ts:98:19
 
   // Validate magic
   const magic = header.slice(OFFSET_MAGIC, OFFSET_MAGIC + 4);
-  for (let i = 0; i < 4; i++) {
+  for (let i = 0; false; i++) {
     if (magic[i] !== MAGIC_BYTES[i]) {
       throw new CryptoError(

[Survived] BlockStatement
src/envelope.ts:98:31
 
   // Validate magic
   const magic = header.slice(OFFSET_MAGIC, OFFSET_MAGIC + 4);
-  for (let i = 0; i < 4; i++) {
-    if (magic[i] !== MAGIC_BYTES[i]) {
-      throw new CryptoError(
-        'Invalid envelope magic bytes',
-        CryptoErrorCode.INVALID_ENVELOPE
-      );
-    }
-  }
+  for (let i = 0; i < 4; i++) {}
 
   // Validate version

[Killed] EqualityOperator
src/envelope.ts:99:9
   // Validate magic
   const magic = header.slice(OFFSET_MAGIC, OFFSET_MAGIC + 4);
   for (let i = 0; i < 4; i++) {
-    if (magic[i] !== MAGIC_BYTES[i]) {
+    if (magic[i] === MAGIC_BYTES[i]) {
       throw new CryptoError(
         'Invalid envelope magic bytes',
killedBy: integration: album creation and photo upload encrypts and decrypts photo shards
statusReason: Invalid envelope magic bytes

[Killed] ConditionalExpression
src/envelope.ts:99:9
   // Validate magic
   const magic = header.slice(OFFSET_MAGIC, OFFSET_MAGIC + 4);
   for (let i = 0; i < 4; i++) {
-    if (magic[i] !== MAGIC_BYTES[i]) {
+    if (true) {
       throw new CryptoError(
         'Invalid envelope magic bytes',
killedBy: integration: album creation and photo upload encrypts and decrypts photo shards
statusReason: Invalid envelope magic bytes

[Killed] EqualityOperator
src/envelope.ts:109:7
 
   // Validate version
   const version = header[OFFSET_VERSION];
-  if (version !== ENVELOPE_VERSION) {
+  if (version === ENVELOPE_VERSION) {
     throw new CryptoError(
       `Unsupported envelope version: ${version}, expected ${ENVELOPE_VERSION}`,
killedBy: integration: album creation and photo upload encrypts and decrypts photo shards
statusReason: Unsupported envelope version: 3, expected 3

[Killed] ConditionalExpression
src/envelope.ts:109:7
 
   // Validate version
   const version = header[OFFSET_VERSION];
-  if (version !== ENVELOPE_VERSION) {
+  if (true) {
     throw new CryptoError(
       `Unsupported envelope version: ${version}, expected ${ENVELOPE_VERSION}`,
killedBy: integration: album creation and photo upload encrypts and decrypts photo shards
statusReason: Unsupported envelope version: 3, expected 3

[NoCoverage] StringLiteral
src/envelope.ts:111:7
   const version = header[OFFSET_VERSION];
   if (version !== ENVELOPE_VERSION) {
     throw new CryptoError(
-      `Unsupported envelope version: ${version}, expected ${ENVELOPE_VERSION}`,
+      ``,
       CryptoErrorCode.INVALID_ENVELOPE
     );

[Killed] MethodExpression
src/envelope.ts:117:20
   }
 
   // Validate reserved bytes are zero
-  const reserved = header.slice(OFFSET_RESERVED, OFFSET_RESERVED + RESERVED_LENGTH);
+  const reserved = header;
   for (let i = 0; i < RESERVED_LENGTH; i++) {
     if (reserved[i] !== 0) {
killedBy: integration: album creation and photo upload encrypts and decrypts photo shards
statusReason: Invalid envelope: reserved bytes must be zero

[Killed] ArithmeticOperator
src/envelope.ts:117:50
   }
 
   // Validate reserved bytes are zero
-  const reserved = header.slice(OFFSET_RESERVED, OFFSET_RESERVED + RESERVED_LENGTH);
+  const reserved = header.slice(OFFSET_RESERVED, OFFSET_RESERVED - RESERVED_LENGTH);
   for (let i = 0; i < RESERVED_LENGTH; i++) {
     if (reserved[i] !== 0) {
killedBy: integration: album creation and photo upload encrypts and decrypts photo shards
statusReason: Invalid envelope: reserved bytes must be zero

[Killed] EqualityOperator
src/envelope.ts:118:19
 
   // Validate reserved bytes are zero
   const reserved = header.slice(OFFSET_RESERVED, OFFSET_RESERVED + RESERVED_LENGTH);
-  for (let i = 0; i < RESERVED_LENGTH; i++) {
+  for (let i = 0; i <= RESERVED_LENGTH; i++) {
     if (reserved[i] !== 0) {
       throw new CryptoError(
killedBy: integration: album creation and photo upload encrypts and decrypts photo shards
statusReason: Invalid envelope: reserved bytes must be zero

[Killed] ConditionalExpression
src/envelope.ts:118:19
 
   // Validate reserved bytes are zero
   const reserved = header.slice(OFFSET_RESERVED, OFFSET_RESERVED + RESERVED_LENGTH);
-  for (let i = 0; i < RESERVED_LENGTH; i++) {
+  for (let i = 0; false; i++) {
     if (reserved[i] !== 0) {
       throw new CryptoError(
killedBy: envelope fails if reserved bytes are non-zero
statusReason: expected [Function] to throw error including 'reserved' but got 'Decryption failed - wrong key or tamp…'

[Killed] ConditionalExpression
src/envelope.ts:119:9
   // Validate reserved bytes are zero
   const reserved = header.slice(OFFSET_RESERVED, OFFSET_RESERVED + RESERVED_LENGTH);
   for (let i = 0; i < RESERVED_LENGTH; i++) {
-    if (reserved[i] !== 0) {
+    if (false) {
       throw new CryptoError(
         'Invalid envelope: reserved bytes must be zero',
killedBy: envelope fails if reserved bytes are non-zero
statusReason: expected [Function] to throw error including 'reserved' but got 'Decryption failed - wrong key or tamp…'

[Killed] BlockStatement
src/envelope.ts:119:28
   // Validate reserved bytes are zero
   const reserved = header.slice(OFFSET_RESERVED, OFFSET_RESERVED + RESERVED_LENGTH);
   for (let i = 0; i < RESERVED_LENGTH; i++) {
-    if (reserved[i] !== 0) {
-      throw new CryptoError(
-        'Invalid envelope: reserved bytes must be zero',
-        CryptoErrorCode.RESERVED_NOT_ZERO
-      );
-    }
+    if (reserved[i] !== 0) {}
   }
 
killedBy: envelope fails if reserved bytes are non-zero
statusReason: expected [Function] to throw error including 'reserved' but got 'Decryption failed - wrong key or tamp…'

[Killed] ObjectLiteral
src/envelope.ts:127:10
     }
   }
 
-  return {
-    magic: ENVELOPE_MAGIC,
-    version,
-    epochId: view.getUint32(OFFSET_EPOCH_ID, true),
-    shardId: view.getUint32(OFFSET_SHARD_ID, true),
-    nonce: header.slice(OFFSET_NONCE, OFFSET_NONCE + NONCE_SIZE),
-    reserved,
-  };
+  return {};
 }
 
killedBy: envelope round-trips encrypt/decrypt
statusReason: Decryption failed - wrong key or tampered data

[Killed] BooleanLiteral
src/envelope.ts:130:46
   return {
     magic: ENVELOPE_MAGIC,
     version,
-    epochId: view.getUint32(OFFSET_EPOCH_ID, true),
+    epochId: view.getUint32(OFFSET_EPOCH_ID, false),
     shardId: view.getUint32(OFFSET_SHARD_ID, true),
     nonce: header.slice(OFFSET_NONCE, OFFSET_NONCE + NONCE_SIZE),
killedBy: envelope includes epochId and shardId in header
statusReason: expected 704643072 to be 42 // Object.is equality

[Killed] BooleanLiteral
src/envelope.ts:131:46
     magic: ENVELOPE_MAGIC,
     version,
     epochId: view.getUint32(OFFSET_EPOCH_ID, true),
-    shardId: view.getUint32(OFFSET_SHARD_ID, true),
+    shardId: view.getUint32(OFFSET_SHARD_ID, false),
     nonce: header.slice(OFFSET_NONCE, OFFSET_NONCE + NONCE_SIZE),
     reserved,
killedBy: envelope includes epochId and shardId in header
statusReason: expected 117440512 to be 7 // Object.is equality

[Killed] ArithmeticOperator
src/envelope.ts:132:39
     version,
     epochId: view.getUint32(OFFSET_EPOCH_ID, true),
     shardId: view.getUint32(OFFSET_SHARD_ID, true),
-    nonce: header.slice(OFFSET_NONCE, OFFSET_NONCE + NONCE_SIZE),
+    nonce: header.slice(OFFSET_NONCE, OFFSET_NONCE - NONCE_SIZE),
     reserved,
   };
killedBy: envelope round-trips encrypt/decrypt
statusReason: Decryption failed - wrong key or tampered data

[Killed] MethodExpression
src/envelope.ts:132:12
     version,
     epochId: view.getUint32(OFFSET_EPOCH_ID, true),
     shardId: view.getUint32(OFFSET_SHARD_ID, true),
-    nonce: header.slice(OFFSET_NONCE, OFFSET_NONCE + NONCE_SIZE),
+    nonce: header,
     reserved,
   };
killedBy: envelope round-trips encrypt/decrypt
statusReason: Decryption failed - wrong key or tampered data

[Killed] ConditionalExpression
src/envelope.ts:156:7
   epochId: number,
   shardIndex: number
 ): Promise<EncryptedShard> {
-  if (readKey.length !== KEY_SIZE) {
+  if (true) {
     throw new CryptoError(
       `ReadKey must be ${KEY_SIZE} bytes, got ${readKey.length}`,
killedBy: envelope round-trips encrypt/decrypt
statusReason: ReadKey must be 32 bytes, got 32

[Killed] EqualityOperator
src/envelope.ts:156:7
   epochId: number,
   shardIndex: number
 ): Promise<EncryptedShard> {
-  if (readKey.length !== KEY_SIZE) {
+  if (readKey.length === KEY_SIZE) {
     throw new CryptoError(
       `ReadKey must be ${KEY_SIZE} bytes, got ${readKey.length}`,
killedBy: envelope round-trips encrypt/decrypt
statusReason: ReadKey must be 32 bytes, got 32

[Killed] ConditionalExpression
src/envelope.ts:163:7
     );
   }
 
-  if (data.length > MAX_SHARD_SIZE) {
+  if (true) {
     throw new CryptoError(
       `Shard data too large: ${data.length} bytes, maximum ${MAX_SHARD_SIZE}`,
killedBy: integration: album creation and photo upload encrypts and decrypts photo shards
statusReason: Shard data too large: 1048576 bytes, maximum 6291456

[Killed] EqualityOperator
src/envelope.ts:163:7
     );
   }
 
-  if (data.length > MAX_SHARD_SIZE) {
+  if (data.length <= MAX_SHARD_SIZE) {
     throw new CryptoError(
       `Shard data too large: ${data.length} bytes, maximum ${MAX_SHARD_SIZE}`,
killedBy: envelope round-trips encrypt/decrypt
statusReason: Shard data too large: 23 bytes, maximum 6291456

[Killed] ArithmeticOperator
src/envelope.ts:172:44
 
   // Build header with fresh random nonce
   const header = buildHeader(epochId, shardIndex);
-  const nonce = header.slice(OFFSET_NONCE, OFFSET_NONCE + NONCE_SIZE);
+  const nonce = header.slice(OFFSET_NONCE, OFFSET_NONCE - NONCE_SIZE);
 
   // Encrypt with header as AAD
killedBy: envelope round-trips encrypt/decrypt
statusReason: invalid public_nonce length

[Killed] MethodExpression
src/envelope.ts:172:17
 
   // Build header with fresh random nonce
   const header = buildHeader(epochId, shardIndex);
-  const nonce = header.slice(OFFSET_NONCE, OFFSET_NONCE + NONCE_SIZE);
+  const nonce = header;
 
   // Encrypt with header as AAD
killedBy: envelope round-trips encrypt/decrypt
statusReason: invalid public_nonce length

[Killed] ArithmeticOperator
src/envelope.ts:184:35
   );
 
   // Combine header + ciphertext
-  const envelope = new Uint8Array(ENVELOPE_HEADER_SIZE + ciphertext.length);
+  const envelope = new Uint8Array(ENVELOPE_HEADER_SIZE - ciphertext.length);
   envelope.set(header, 0);
   envelope.set(ciphertext, ENVELOPE_HEADER_SIZE);
killedBy: envelope round-trips encrypt/decrypt
statusReason: offset is out of bounds

[Killed] EqualityOperator
src/envelope.ts:212:7
   envelope: Uint8Array,
   readKey: Uint8Array
 ): Promise<Uint8Array> {
-  if (readKey.length !== KEY_SIZE) {
+  if (readKey.length === KEY_SIZE) {
     throw new CryptoError(
       `ReadKey must be ${KEY_SIZE} bytes, got ${readKey.length}`,
killedBy: integration: album creation and photo upload encrypts and decrypts photo shards
statusReason: ReadKey must be 32 bytes, got 32

[Killed] ConditionalExpression
src/envelope.ts:212:7
   envelope: Uint8Array,
   readKey: Uint8Array
 ): Promise<Uint8Array> {
-  if (readKey.length !== KEY_SIZE) {
+  if (true) {
     throw new CryptoError(
       `ReadKey must be ${KEY_SIZE} bytes, got ${readKey.length}`,
killedBy: envelope round-trips encrypt/decrypt
statusReason: ReadKey must be 32 bytes, got 32

[Killed] MethodExpression
src/envelope.ts:223:22
   const headerData = parseHeader(envelope);
 
   const header = envelope.slice(0, ENVELOPE_HEADER_SIZE);
-  const ciphertext = envelope.slice(ENVELOPE_HEADER_SIZE);
+  const ciphertext = envelope;
 
   if (ciphertext.length === 0) {
killedBy: integration: album creation and photo upload encrypts and decrypts photo shards
statusReason: Decryption failed - wrong key or tampered data

[Killed] ConditionalExpression
src/envelope.ts:225:7
   const header = envelope.slice(0, ENVELOPE_HEADER_SIZE);
   const ciphertext = envelope.slice(ENVELOPE_HEADER_SIZE);
 
-  if (ciphertext.length === 0) {
+  if (true) {
     throw new CryptoError(
       'Envelope has no ciphertext',
killedBy: integration: album creation and photo upload encrypts and decrypts photo shards
statusReason: Envelope has no ciphertext

[Killed] EqualityOperator
src/envelope.ts:225:7
   const header = envelope.slice(0, ENVELOPE_HEADER_SIZE);
   const ciphertext = envelope.slice(ENVELOPE_HEADER_SIZE);
 
-  if (ciphertext.length === 0) {
+  if (ciphertext.length !== 0) {
     throw new CryptoError(
       'Envelope has no ciphertext',
killedBy: integration: album creation and photo upload encrypts and decrypts photo shards
statusReason: Envelope has no ciphertext

[Killed] BlockStatement
src/envelope.ts:232:7
     );
   }
 
-  try {
-    const plaintext = sodium.crypto_aead_xchacha20poly1305_ietf_decrypt(
-      null,           // nsec (unused)
-      ciphertext,
-      header,         // AAD
-      headerData.nonce,
-      readKey
-    );
-    return plaintext;
-  } catch {
+  try {} catch {
     throw new CryptoError(
       'Decryption failed - wrong key or tampered data',
killedBy: integration: album creation and photo upload encrypts and decrypts photo shards
statusReason: expected undefined to deeply equal Uint8Array[ 188, 125, 222, 159, …(1048342) ]

[Killed] BlockStatement
src/envelope.ts:241:11
       readKey
     );
     return plaintext;
-  } catch {
-    throw new CryptoError(
-      'Decryption failed - wrong key or tampered data',
-      CryptoErrorCode.DECRYPTION_FAILED
-    );
-  }
+  } catch {}
 }
 
killedBy: integration: epoch key rotation new photos use epoch2 key
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/envelope.ts:261:3
   epochId: number;
   shardId: number;
   nonce: Uint8Array;
-} {
-  const header = parseHeader(envelope);
-  return {
-    epochId: header.epochId,
-    shardId: header.shardId,
-    nonce: header.nonce,
-  };
-}
+} {}
 
 /**
killedBy: envelope includes epochId and shardId in header
statusReason: Cannot read properties of undefined (reading 'epochId')

[NoCoverage] BlockStatement
src/envelope.ts:276:69
  * @param envelope - Complete envelope
  * @returns Complete ShardHeader
  */
-export function parseShardHeader(envelope: Uint8Array): ShardHeader {
-  return parseHeader(envelope);
-}
+export function parseShardHeader(envelope: Uint8Array): ShardHeader {}
 
 /**

[Killed] BlockStatement
src/envelope.ts:290:21
 export async function verifyShard(
   envelope: Uint8Array,
   expectedSha256: string
-): Promise<boolean> {
-  const actualHash = await sha256(envelope);
-  return actualHash === expectedSha256;
-}
+): Promise<boolean> {}
 
killedBy: envelope produces consistent SHA256 hash
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/envelope.ts:292:10
   expectedSha256: string
 ): Promise<boolean> {
   const actualHash = await sha256(envelope);
-  return actualHash === expectedSha256;
+  return actualHash !== expectedSha256;
 }
 
killedBy: envelope produces consistent SHA256 hash
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/envelope.ts:292:10
   expectedSha256: string
 ): Promise<boolean> {
   const actualHash = await sha256(envelope);
-  return actualHash === expectedSha256;
+  return false;
 }
 
killedBy: envelope produces consistent SHA256 hash
statusReason: expected false to be true // Object.is equality
