[Killed] EqualityOperator
src/identity.ts:31:7
  * @throws CryptoError if seed is not 32 bytes
  */
 export function deriveIdentityKeypair(seed: Uint8Array): IdentityKeypair {
-  if (seed.length !== KEY_SIZE) {
+  if (seed.length === KEY_SIZE) {
     throw new CryptoError(
       `Identity seed must be ${KEY_SIZE} bytes, got ${seed.length}`,
killedBy: integration: user registration flow derives identity keypair from account key
statusReason: Identity seed must be 32 bytes, got 32

[Killed] ConditionalExpression
src/identity.ts:31:7
  * @throws CryptoError if seed is not 32 bytes
  */
 export function deriveIdentityKeypair(seed: Uint8Array): IdentityKeypair {
-  if (seed.length !== KEY_SIZE) {
+  if (true) {
     throw new CryptoError(
       `Identity seed must be ${KEY_SIZE} bytes, got ${seed.length}`,
killedBy: integration: user registration flow derives identity keypair from account key
statusReason: Identity seed must be 32 bytes, got 32

[Killed] BlockStatement
src/identity.ts:46:7
   let x25519Secret: Uint8Array;
   let x25519Public: Uint8Array;
 
-  try {
-    x25519Secret = sodium.crypto_sign_ed25519_sk_to_curve25519(ed25519.privateKey);
-    x25519Public = sodium.crypto_sign_ed25519_pk_to_curve25519(ed25519.publicKey);
-  } catch (error) {
+  try {} catch (error) {
     throw new CryptoError(
       'Failed to convert Ed25519 to X25519',
killedBy: integration: user registration flow derives identity keypair from account key
statusReason: Target cannot be null or undefined.

[NoCoverage] BlockStatement
src/identity.ts:49:19
   try {
     x25519Secret = sodium.crypto_sign_ed25519_sk_to_curve25519(ed25519.privateKey);
     x25519Public = sodium.crypto_sign_ed25519_pk_to_curve25519(ed25519.publicKey);
-  } catch (error) {
-    throw new CryptoError(
-      'Failed to convert Ed25519 to X25519',
-      CryptoErrorCode.KEY_CONVERSION_FAILED,
-      error
-    );
-  }
+  } catch (error) {}
 
   return {

[Killed] ObjectLiteral
src/identity.ts:58:14
   }
 
   return {
-    ed25519: {
-      publicKey: ed25519.publicKey,
-      secretKey: ed25519.privateKey,
-    },
+    ed25519: {},
     x25519: {
       publicKey: x25519Public,
killedBy: integration: user registration flow derives identity keypair from account key
statusReason: Target cannot be null or undefined.

[Killed] ObjectLiteral
src/identity.ts:62:13
       publicKey: ed25519.publicKey,
       secretKey: ed25519.privateKey,
     },
-    x25519: {
-      publicKey: x25519Public,
-      secretKey: x25519Secret,
-    },
+    x25519: {},
   };
 }
killedBy: integration: user registration flow derives identity keypair from account key
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
src/identity.ts:77:72
  * @returns X25519 public key (32 bytes)
  * @throws CryptoError if conversion fails
  */
-export function ed25519PubToX25519(ed25519Pub: Uint8Array): Uint8Array {
-  if (ed25519Pub.length !== ED25519_PUBLIC_KEY_LENGTH) {
-    throw new CryptoError(
-      `Ed25519 public key must be ${ED25519_PUBLIC_KEY_LENGTH} bytes, got ${ed25519Pub.length}`,
-      CryptoErrorCode.INVALID_KEY_LENGTH
-    );
-  }
-
-  try {
-    return sodium.crypto_sign_ed25519_pk_to_curve25519(ed25519Pub);
-  } catch (error) {
-    throw new CryptoError(
-      'Failed to convert Ed25519 public key to X25519',
-      CryptoErrorCode.KEY_CONVERSION_FAILED,
-      error
-    );
-  }
-}
+export function ed25519PubToX25519(ed25519Pub: Uint8Array): Uint8Array {}
 
 /**
killedBy: integration: album sharing between users owner can share epoch key with recipient
statusReason: publicKey cannot be null or undefined

[Killed] EqualityOperator
src/identity.ts:78:7
  * @throws CryptoError if conversion fails
  */
 export function ed25519PubToX25519(ed25519Pub: Uint8Array): Uint8Array {
-  if (ed25519Pub.length !== ED25519_PUBLIC_KEY_LENGTH) {
+  if (ed25519Pub.length === ED25519_PUBLIC_KEY_LENGTH) {
     throw new CryptoError(
       `Ed25519 public key must be ${ED25519_PUBLIC_KEY_LENGTH} bytes, got ${ed25519Pub.length}`,
killedBy: integration: album sharing between users owner can share epoch key with recipient
statusReason: Ed25519 public key must be 32 bytes, got 32

[Killed] ConditionalExpression
src/identity.ts:78:7
  * @throws CryptoError if conversion fails
  */
 export function ed25519PubToX25519(ed25519Pub: Uint8Array): Uint8Array {
-  if (ed25519Pub.length !== ED25519_PUBLIC_KEY_LENGTH) {
+  if (true) {
     throw new CryptoError(
       `Ed25519 public key must be ${ED25519_PUBLIC_KEY_LENGTH} bytes, got ${ed25519Pub.length}`,
killedBy: integration: album sharing between users owner can share epoch key with recipient
statusReason: Ed25519 public key must be 32 bytes, got 32

[Killed] BlockStatement
src/identity.ts:85:7
     );
   }
 
-  try {
-    return sodium.crypto_sign_ed25519_pk_to_curve25519(ed25519Pub);
-  } catch (error) {
+  try {} catch (error) {
     throw new CryptoError(
       'Failed to convert Ed25519 public key to X25519',
killedBy: integration: album sharing between users owner can share epoch key with recipient
statusReason: publicKey cannot be null or undefined

[NoCoverage] BlockStatement
src/identity.ts:87:19
 
   try {
     return sodium.crypto_sign_ed25519_pk_to_curve25519(ed25519Pub);
-  } catch (error) {
-    throw new CryptoError(
-      'Failed to convert Ed25519 public key to X25519',
-      CryptoErrorCode.KEY_CONVERSION_FAILED,
-      error
-    );
-  }
+  } catch (error) {}
 }
 

[Killed] BlockStatement
src/identity.ts:104:78
  * @returns X25519 secret key (32 bytes)
  * @throws CryptoError if conversion fails
  */
-export function ed25519SecretToX25519(ed25519Secret: Uint8Array): Uint8Array {
-  if (ed25519Secret.length !== ED25519_SECRET_KEY_LENGTH) {
-    throw new CryptoError(
-      `Ed25519 secret key must be ${ED25519_SECRET_KEY_LENGTH} bytes, got ${ed25519Secret.length}`,
-      CryptoErrorCode.INVALID_KEY_LENGTH
-    );
-  }
-
-  try {
-    return sodium.crypto_sign_ed25519_sk_to_curve25519(ed25519Secret);
-  } catch (error) {
-    throw new CryptoError(
-      'Failed to convert Ed25519 secret key to X25519',
-      CryptoErrorCode.KEY_CONVERSION_FAILED,
-      error
-    );
-  }
-}
+export function ed25519SecretToX25519(ed25519Secret: Uint8Array): Uint8Array {}
 
 /**
killedBy: identity converts Ed25519 secret to X25519
statusReason: expected undefined to deeply equal Uint8Array[ 32, 159, 145, 119, …(-24) ]

[Killed] EqualityOperator
src/identity.ts:105:7
  * @throws CryptoError if conversion fails
  */
 export function ed25519SecretToX25519(ed25519Secret: Uint8Array): Uint8Array {
-  if (ed25519Secret.length !== ED25519_SECRET_KEY_LENGTH) {
+  if (ed25519Secret.length === ED25519_SECRET_KEY_LENGTH) {
     throw new CryptoError(
       `Ed25519 secret key must be ${ED25519_SECRET_KEY_LENGTH} bytes, got ${ed25519Secret.length}`,
killedBy: identity converts Ed25519 secret to X25519
statusReason: Ed25519 secret key must be 64 bytes, got 64

[Killed] ConditionalExpression
src/identity.ts:105:7
  * @throws CryptoError if conversion fails
  */
 export function ed25519SecretToX25519(ed25519Secret: Uint8Array): Uint8Array {
-  if (ed25519Secret.length !== ED25519_SECRET_KEY_LENGTH) {
+  if (true) {
     throw new CryptoError(
       `Ed25519 secret key must be ${ED25519_SECRET_KEY_LENGTH} bytes, got ${ed25519Secret.length}`,
killedBy: identity converts Ed25519 secret to X25519
statusReason: Ed25519 secret key must be 64 bytes, got 64

[Killed] BlockStatement
src/identity.ts:112:7
     );
   }
 
-  try {
-    return sodium.crypto_sign_ed25519_sk_to_curve25519(ed25519Secret);
-  } catch (error) {
+  try {} catch (error) {
     throw new CryptoError(
       'Failed to convert Ed25519 secret key to X25519',
killedBy: identity converts Ed25519 secret to X25519
statusReason: expected undefined to deeply equal Uint8Array[ 192, 38, 238, 205, 2, …(-131) ]

[NoCoverage] BlockStatement
src/identity.ts:114:19
 
   try {
     return sodium.crypto_sign_ed25519_sk_to_curve25519(ed25519Secret);
-  } catch (error) {
-    throw new CryptoError(
-      'Failed to convert Ed25519 secret key to X25519',
-      CryptoErrorCode.KEY_CONVERSION_FAILED,
-      error
-    );
-  }
+  } catch (error) {}
 }
 

[NoCoverage] StringLiteral
src/identity.ts:116:7
     return sodium.crypto_sign_ed25519_sk_to_curve25519(ed25519Secret);
   } catch (error) {
     throw new CryptoError(
-      'Failed to convert Ed25519 secret key to X25519',
+      "",
       CryptoErrorCode.KEY_CONVERSION_FAILED,
       error

[Killed] BlockStatement
src/identity.ts:129:52
  *
  * @returns 32 random bytes suitable for deriveIdentityKeypair
  */
-export function generateIdentitySeed(): Uint8Array {
-  return randomBytes(KEY_SIZE);
-}
+export function generateIdentitySeed(): Uint8Array {}
 
 /**
killedBy: identity produces valid Ed25519 signatures
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/identity.ts:142:3
 export function generateEd25519Keypair(): {
   publicKey: Uint8Array;
   secretKey: Uint8Array;
-} {
-  const keypair = sodium.crypto_sign_keypair();
-  return {
-    publicKey: keypair.publicKey,
-    secretKey: keypair.privateKey,
-  };
-}
+} {}
 
 /**
killedBy: identity generates random Ed25519 keypairs
statusReason: Cannot read properties of undefined (reading 'publicKey')

[Killed] BlockStatement
src/identity.ts:157:73
  * @param publicKey - Ed25519 public key to validate
  * @returns true if valid
  */
-export function isValidEd25519PublicKey(publicKey: Uint8Array): boolean {
-  if (publicKey.length !== ED25519_PUBLIC_KEY_LENGTH) {
-    return false;
-  }
-
-  try {
-    // Try to convert to X25519 as validation
-    sodium.crypto_sign_ed25519_pk_to_curve25519(publicKey);
-    return true;
-  } catch {
-    return false;
-  }
-}
+export function isValidEd25519PublicKey(publicKey: Uint8Array): boolean {}
 
killedBy: identity validates Ed25519 public keys
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/identity.ts:158:7
  * @returns true if valid
  */
 export function isValidEd25519PublicKey(publicKey: Uint8Array): boolean {
-  if (publicKey.length !== ED25519_PUBLIC_KEY_LENGTH) {
+  if (true) {
     return false;
   }
killedBy: identity validates Ed25519 public keys
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/identity.ts:158:7
  * @returns true if valid
  */
 export function isValidEd25519PublicKey(publicKey: Uint8Array): boolean {
-  if (publicKey.length !== ED25519_PUBLIC_KEY_LENGTH) {
+  if (publicKey.length === ED25519_PUBLIC_KEY_LENGTH) {
     return false;
   }
killedBy: identity validates Ed25519 public keys
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/identity.ts:159:12
  */
 export function isValidEd25519PublicKey(publicKey: Uint8Array): boolean {
   if (publicKey.length !== ED25519_PUBLIC_KEY_LENGTH) {
-    return false;
+    return true;
   }
 
killedBy: identity validates Ed25519 public keys
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/identity.ts:162:7
     return false;
   }
 
-  try {
-    // Try to convert to X25519 as validation
-    sodium.crypto_sign_ed25519_pk_to_curve25519(publicKey);
-    return true;
-  } catch {
+  try {} catch {
     return false;
   }
killedBy: identity validates Ed25519 public keys
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
src/identity.ts:165:12
   try {
     // Try to convert to X25519 as validation
     sodium.crypto_sign_ed25519_pk_to_curve25519(publicKey);
-    return true;
+    return false;
   } catch {
     return false;
killedBy: identity validates Ed25519 public keys
statusReason: expected false to be true // Object.is equality
