[Killed] ConditionalExpression
src/keychain.ts:41:7
 ): Promise<DerivedKeys> {
   await sodium.ready;
 
-  if (userSalt.length !== 16) {
+  if (true) {
     throw new Error('User salt must be 16 bytes');
   }
killedBy: integration: user registration flow derives and unwraps consistent account key
statusReason: User salt must be 16 bytes

[Killed] EqualityOperator
src/keychain.ts:41:7
 ): Promise<DerivedKeys> {
   await sodium.ready;
 
-  if (userSalt.length !== 16) {
+  if (userSalt.length === 16) {
     throw new Error('User salt must be 16 bytes');
   }
killedBy: integration: user registration flow derives and unwraps consistent account key
statusReason: User salt must be 16 bytes

[Survived] StringLiteral
src/keychain.ts:42:21
   await sodium.ready;
 
   if (userSalt.length !== 16) {
-    throw new Error('User salt must be 16 bytes');
+    throw new Error("");
   }
   if (accountSalt.length !== 16) {

[Killed] BlockStatement
src/keychain.ts:44:34
   if (userSalt.length !== 16) {
     throw new Error('User salt must be 16 bytes');
   }
-  if (accountSalt.length !== 16) {
-    throw new Error('Account salt must be 16 bytes');
-  }
+  if (accountSalt.length !== 16) {}
 
   const argon2Params = params ?? getArgon2Params();
killedBy: keychain rejects invalid salt lengths
statusReason: promise resolved "{ …(4) }" instead of rejecting

[Killed] EqualityOperator
src/keychain.ts:44:7
   if (userSalt.length !== 16) {
     throw new Error('User salt must be 16 bytes');
   }
-  if (accountSalt.length !== 16) {
+  if (accountSalt.length === 16) {
     throw new Error('Account salt must be 16 bytes');
   }
killedBy: integration: user registration flow derives and unwraps consistent account key
statusReason: Account salt must be 16 bytes

[Killed] LogicalOperator
src/keychain.ts:48:24
     throw new Error('Account salt must be 16 bytes');
   }
 
-  const argon2Params = params ?? getArgon2Params();
+  const argon2Params = params && getArgon2Params();
 
   // L0: Master Key from Argon2id(password, userSalt)
killedBy: keychain unwraps account key correctly
statusReason: Failed to unwrap account key - wrong password or corrupted data

[Killed] ArithmeticOperator
src/keychain.ts:56:5
     password,
     userSalt,
     argon2Params.iterations,
-    argon2Params.memory * 1024, // Convert KiB to bytes
+    argon2Params.memory / 1024, // Convert KiB to bytes
     sodium.crypto_pwhash_ALG_ARGON2ID13
   );
killedBy: integration: user registration flow derives and unwraps consistent account key
statusReason: invalid usage

[Killed] ArithmeticOperator
src/keychain.ts:86:44
   const ciphertext = sodium.crypto_secretbox_easy(accountKey, nonce, rootKey);
 
   // accountKeyWrapped = nonce || ciphertext
-  const accountKeyWrapped = new Uint8Array(24 + ciphertext.length);
+  const accountKeyWrapped = new Uint8Array(24 - ciphertext.length);
   accountKeyWrapped.set(nonce, 0);
   accountKeyWrapped.set(ciphertext, 24);
killedBy: integration: user registration flow derives and unwraps consistent account key
statusReason: Invalid typed array length: -24

[Killed] ConditionalExpression
src/keychain.ts:121:7
   if (userSalt.length !== 16) {
     throw new Error('User salt must be 16 bytes');
   }
-  if (accountSalt.length !== 16) {
+  if (true) {
     throw new Error('Account salt must be 16 bytes');
   }
killedBy: integration: user registration flow derives and unwraps consistent account key
statusReason: Account salt must be 16 bytes

[NoCoverage] StringLiteral
src/keychain.ts:122:21
     throw new Error('User salt must be 16 bytes');
   }
   if (accountSalt.length !== 16) {
-    throw new Error('Account salt must be 16 bytes');
+    throw new Error("");
   }
   if (wrappedAccountKey.length < 24 + 16 + 1) {

[Killed] EqualityOperator
src/keychain.ts:124:7
   if (accountSalt.length !== 16) {
     throw new Error('Account salt must be 16 bytes');
   }
-  if (wrappedAccountKey.length < 24 + 16 + 1) {
+  if (wrappedAccountKey.length >= 24 + 16 + 1) {
     // nonce + tag + at least 1 byte
     throw new Error('Wrapped account key too short');
killedBy: integration: user registration flow derives and unwraps consistent account key
statusReason: Wrapped account key too short

[Killed] ConditionalExpression
src/keychain.ts:124:7
   if (accountSalt.length !== 16) {
     throw new Error('Account salt must be 16 bytes');
   }
-  if (wrappedAccountKey.length < 24 + 16 + 1) {
+  if (true) {
     // nonce + tag + at least 1 byte
     throw new Error('Wrapped account key too short');
killedBy: integration: user registration flow derives and unwraps consistent account key
statusReason: Wrapped account key too short

[NoCoverage] StringLiteral
src/keychain.ts:126:21
   }
   if (wrappedAccountKey.length < 24 + 16 + 1) {
     // nonce + tag + at least 1 byte
-    throw new Error('Wrapped account key too short');
+    throw new Error("");
   }
 

[Killed] ArithmeticOperator
src/keychain.ts:137:5
     password,
     userSalt,
     argon2Params.iterations,
-    argon2Params.memory * 1024,
+    argon2Params.memory / 1024,
     sodium.crypto_pwhash_ALG_ARGON2ID13
   );
killedBy: integration: user registration flow derives and unwraps consistent account key
statusReason: invalid usage

[Killed] MethodExpression
src/keychain.ts:158:17
   memzero(rootKeyIntermediate);
 
   // Unwrap L2
-  const nonce = wrappedAccountKey.slice(0, 24);
+  const nonce = wrappedAccountKey;
   const ciphertext = wrappedAccountKey.slice(24);
 
killedBy: integration: user registration flow derives and unwraps consistent account key
statusReason: Failed to unwrap account key - wrong password or corrupted data

[Killed] MethodExpression
src/keychain.ts:159:22
 
   // Unwrap L2
   const nonce = wrappedAccountKey.slice(0, 24);
-  const ciphertext = wrappedAccountKey.slice(24);
+  const ciphertext = wrappedAccountKey;
 
   try {
killedBy: integration: user registration flow derives and unwraps consistent account key
statusReason: Failed to unwrap account key - wrong password or corrupted data

[Killed] BlockStatement
src/keychain.ts:161:7
   const nonce = wrappedAccountKey.slice(0, 24);
   const ciphertext = wrappedAccountKey.slice(24);
 
-  try {
-    const accountKey = sodium.crypto_secretbox_open_easy(
-      ciphertext,
-      nonce,
-      rootKey
-    );
-    memzero(rootKey);
-    return accountKey;
-  } catch {
+  try {} catch {
     memzero(rootKey);
     throw new Error('Failed to unwrap account key - wrong password or corrupted data');
killedBy: integration: user registration flow derives and unwraps consistent account key
statusReason: expected undefined to deeply equal Uint8Array[ 246, 87, 40, 216, …(-176) ]

[Killed] BlockStatement
src/keychain.ts:169:11
     );
     memzero(rootKey);
     return accountKey;
-  } catch {
-    memzero(rootKey);
-    throw new Error('Failed to unwrap account key - wrong password or corrupted data');
-  }
+  } catch {}
 }
 
killedBy: keychain fails unwrap with wrong password
statusReason: promise resolved "undefined" instead of rejecting

[Killed] EqualityOperator
src/keychain.ts:195:7
 ): Promise<Uint8Array> {
   await sodium.ready;
 
-  if (accountKey.length !== 32) {
+  if (accountKey.length === 32) {
     throw new Error('Account key must be 32 bytes');
   }
killedBy: keychain rewraps account key with new password
statusReason: Account key must be 32 bytes

[Killed] ConditionalExpression
src/keychain.ts:195:7
 ): Promise<Uint8Array> {
   await sodium.ready;
 
-  if (accountKey.length !== 32) {
+  if (true) {
     throw new Error('Account key must be 32 bytes');
   }
killedBy: keychain rewraps account key with new password
statusReason: Account key must be 32 bytes

[Killed] ArithmeticOperator
src/keychain.ts:232:34
   const ciphertext = sodium.crypto_secretbox_easy(accountKey, nonce, rootKey);
   memzero(rootKey);
 
-  const wrapped = new Uint8Array(24 + ciphertext.length);
+  const wrapped = new Uint8Array(24 - ciphertext.length);
   wrapped.set(nonce, 0);
   wrapped.set(ciphertext, 24);
killedBy: keychain rewraps account key with new password
statusReason: Invalid typed array length: -24

[Killed] BlockStatement
src/keychain.ts:244:84
  *
  * @returns Object with userSalt and accountSalt (16 bytes each)
  */
-export function generateSalts(): { userSalt: Uint8Array; accountSalt: Uint8Array } {
-  return {
-    userSalt: randomBytes(16),
-    accountSalt: randomBytes(16),
-  };
-}
+export function generateSalts(): { userSalt: Uint8Array; accountSalt: Uint8Array } {}
 
killedBy: integration: user registration flow derives and unwraps consistent account key
statusReason: Cannot destructure property 'userSalt' of 'generateSalts(...)' as it is undefined.
