[Killed] EqualityOperator
src/sharing.ts:46:7
   recipientEd25519Pub: Uint8Array,
   ownerIdentity: IdentityKeypair
 ): SealedBundle {
-  if (recipientEd25519Pub.length !== 32) {
+  if (recipientEd25519Pub.length === 32) {
     throw new CryptoError(
       `Recipient Ed25519 public key must be 32 bytes, got ${recipientEd25519Pub.length}`,
killedBy: integration: album sharing between users owner can share epoch key with recipient
statusReason: Recipient Ed25519 public key must be 32 bytes, got 32

[Killed] ConditionalExpression
src/sharing.ts:46:7
   recipientEd25519Pub: Uint8Array,
   ownerIdentity: IdentityKeypair
 ): SealedBundle {
-  if (recipientEd25519Pub.length !== 32) {
+  if (true) {
     throw new CryptoError(
       `Recipient Ed25519 public key must be 32 bytes, got ${recipientEd25519Pub.length}`,
killedBy: integration: album sharing between users owner can share epoch key with recipient
statusReason: Recipient Ed25519 public key must be 32 bytes, got 32

[NoCoverage] StringLiteral
src/sharing.ts:48:7
 ): SealedBundle {
   if (recipientEd25519Pub.length !== 32) {
     throw new CryptoError(
-      `Recipient Ed25519 public key must be 32 bytes, got ${recipientEd25519Pub.length}`,
+      ``,
       CryptoErrorCode.INVALID_KEY_LENGTH
     );

[Killed] BooleanLiteral
src/sharing.ts:107:7
 ): EpochKeyBundle {
   // Verify signature FIRST - reject forgeries before decryption
   const toVerify = concat(BUNDLE_CONTEXT, sealed);
-  if (!sodium.crypto_sign_verify_detached(signature, toVerify, ownerEd25519Pub)) {
+  if (sodium.crypto_sign_verify_detached(signature, toVerify, ownerEd25519Pub)) {
     throw new CryptoError(
       'Invalid bundle signature - not from claimed owner',
killedBy: integration: album sharing between users owner can share epoch key with recipient
statusReason: Invalid bundle signature - not from claimed owner

[Killed] ConditionalExpression
src/sharing.ts:107:7
 ): EpochKeyBundle {
   // Verify signature FIRST - reject forgeries before decryption
   const toVerify = concat(BUNDLE_CONTEXT, sealed);
-  if (!sodium.crypto_sign_verify_detached(signature, toVerify, ownerEd25519Pub)) {
+  if (true) {
     throw new CryptoError(
       'Invalid bundle signature - not from claimed owner',
killedBy: integration: album sharing between users owner can share epoch key with recipient
statusReason: Invalid bundle signature - not from claimed owner

[Killed] StringLiteral
src/sharing.ts:109:7
   const toVerify = concat(BUNDLE_CONTEXT, sealed);
   if (!sodium.crypto_sign_verify_detached(signature, toVerify, ownerEd25519Pub)) {
     throw new CryptoError(
-      'Invalid bundle signature - not from claimed owner',
+      "",
       CryptoErrorCode.SIGNATURE_INVALID
     );
killedBy: sharing rejects invalid signature
statusReason: expected [Function] to throw error including 'signature' but got ''

[Killed] BlockStatement
src/sharing.ts:116:7
 
   // Open sealed box
   let bundleBytes: Uint8Array;
-  try {
-    bundleBytes = sodium.crypto_box_seal_open(
-      sealed,
-      myIdentity.x25519.publicKey,
-      myIdentity.x25519.secretKey
-    );
-  } catch {
+  try {} catch {
     throw new CryptoError(
       'Failed to open sealed bundle - not intended for this recipient',
killedBy: integration: album sharing between users owner can share epoch key with recipient
statusReason: Failed to parse bundle JSON

[Survived] BlockStatement
src/sharing.ts:122:11
       myIdentity.x25519.publicKey,
       myIdentity.x25519.secretKey
     );
-  } catch {
-    throw new CryptoError(
-      'Failed to open sealed bundle - not intended for this recipient',
-      CryptoErrorCode.DECRYPTION_FAILED
-    );
-  }
+  } catch {}
 
   // Parse JSON

[Killed] BlockStatement
src/sharing.ts:142:7
     };
   };
 
-  try {
-    bundleJson = JSON.parse(new TextDecoder().decode(bundleBytes));
-  } catch {
+  try {} catch {
     throw new CryptoError(
       'Failed to parse bundle JSON',
killedBy: integration: album sharing between users owner can share epoch key with recipient
statusReason: Cannot read properties of undefined (reading 'albumId')

[NoCoverage] BlockStatement
src/sharing.ts:144:11
 
   try {
     bundleJson = JSON.parse(new TextDecoder().decode(bundleBytes));
-  } catch {
-    throw new CryptoError(
-      'Failed to parse bundle JSON',
-      CryptoErrorCode.INVALID_ENVELOPE
-    );
-  }
+  } catch {}
 
   // Validate album ID

[Killed] ConditionalExpression
src/sharing.ts:152:7
   }
 
   // Validate album ID
-  if (bundleJson.albumId !== expectedContext.albumId) {
+  if (false) {
     throw new CryptoError(
       `Bundle albumId mismatch: expected ${expectedContext.albumId}, got ${bundleJson.albumId}`,
killedBy: integration: album sharing between users rejects bundle for wrong album
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/sharing.ts:152:7
   }
 
   // Validate album ID
-  if (bundleJson.albumId !== expectedContext.albumId) {
+  if (bundleJson.albumId === expectedContext.albumId) {
     throw new CryptoError(
       `Bundle albumId mismatch: expected ${expectedContext.albumId}, got ${bundleJson.albumId}`,
killedBy: integration: album sharing between users owner can share epoch key with recipient
statusReason: Bundle albumId mismatch: expected shared-album-1766872098397, got shared-album-1766872098397

[Killed] StringLiteral
src/sharing.ts:154:7
   // Validate album ID
   if (bundleJson.albumId !== expectedContext.albumId) {
     throw new CryptoError(
-      `Bundle albumId mismatch: expected ${expectedContext.albumId}, got ${bundleJson.albumId}`,
+      ``,
       CryptoErrorCode.CONTEXT_MISMATCH
     );
killedBy: sharing rejects albumId mismatch
statusReason: expected [Function] to throw error including 'albumId' but got ''

[Killed] ConditionalExpression
src/sharing.ts:160:7
   }
 
   // Validate epoch ID (prevent replay of old keys)
-  if (bundleJson.epochId < expectedContext.minEpochId) {
+  if (false) {
     throw new CryptoError(
       `Bundle epochId too old: ${bundleJson.epochId} < ${expectedContext.minEpochId}`,
killedBy: sharing rejects old epochId
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/sharing.ts:160:56
   }
 
   // Validate epoch ID (prevent replay of old keys)
-  if (bundleJson.epochId < expectedContext.minEpochId) {
-    throw new CryptoError(
-      `Bundle epochId too old: ${bundleJson.epochId} < ${expectedContext.minEpochId}`,
-      CryptoErrorCode.CONTEXT_MISMATCH
-    );
-  }
+  if (bundleJson.epochId < expectedContext.minEpochId) {}
 
   // Verify recipient binding
killedBy: sharing rejects old epochId
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/sharing.ts:162:7
   // Validate epoch ID (prevent replay of old keys)
   if (bundleJson.epochId < expectedContext.minEpochId) {
     throw new CryptoError(
-      `Bundle epochId too old: ${bundleJson.epochId} < ${expectedContext.minEpochId}`,
+      ``,
       CryptoErrorCode.CONTEXT_MISMATCH
     );
killedBy: sharing rejects old epochId
statusReason: expected [Function] to throw error including 'epochId' but got ''

[Killed] EqualityOperator
src/sharing.ts:170:5
   // Verify recipient binding
   const recipientPubkey = fromBase64(bundleJson.recipientPubkey);
   if (
-    recipientPubkey.length !== myIdentity.ed25519.publicKey.length ||
+    recipientPubkey.length === myIdentity.ed25519.publicKey.length ||
     !sodium.memcmp(recipientPubkey, myIdentity.ed25519.publicKey)
   ) {
killedBy: integration: album sharing between users owner can share epoch key with recipient
statusReason: Bundle not intended for this recipient

[Killed] ConditionalExpression
src/sharing.ts:170:5
   // Verify recipient binding
   const recipientPubkey = fromBase64(bundleJson.recipientPubkey);
   if (
-    recipientPubkey.length !== myIdentity.ed25519.publicKey.length ||
-    !sodium.memcmp(recipientPubkey, myIdentity.ed25519.publicKey)
+    true
   ) {
     throw new CryptoError(
killedBy: integration: album sharing between users owner can share epoch key with recipient
statusReason: Bundle not intended for this recipient

[Killed] BooleanLiteral
src/sharing.ts:171:5
   const recipientPubkey = fromBase64(bundleJson.recipientPubkey);
   if (
     recipientPubkey.length !== myIdentity.ed25519.publicKey.length ||
-    !sodium.memcmp(recipientPubkey, myIdentity.ed25519.publicKey)
+    sodium.memcmp(recipientPubkey, myIdentity.ed25519.publicKey)
   ) {
     throw new CryptoError(
killedBy: integration: album sharing between users owner can share epoch key with recipient
statusReason: Bundle not intended for this recipient

[NoCoverage] BlockStatement
src/sharing.ts:172:5
   if (
     recipientPubkey.length !== myIdentity.ed25519.publicKey.length ||
     !sodium.memcmp(recipientPubkey, myIdentity.ed25519.publicKey)
-  ) {
-    throw new CryptoError(
-      'Bundle not intended for this recipient',
-      CryptoErrorCode.CONTEXT_MISMATCH
-    );
-  }
+  ) {}
 
   return {

[Killed] ObjectLiteral
src/sharing.ts:179:10
     );
   }
 
-  return {
-    version: bundleJson.version,
-    albumId: bundleJson.albumId,
-    epochId: bundleJson.epochId,
-    recipientPubkey,
-    readKey: fromBase64(bundleJson.readKey),
-    signKeypair: {
-      publicKey: fromBase64(bundleJson.signKeypair.publicKey),
-      secretKey: fromBase64(bundleJson.signKeypair.secretKey),
-    },
-  };
+  return {};
 }
 
killedBy: integration: album sharing between users owner can share epoch key with recipient
statusReason: expected undefined to be 'shared-album-1766872104351' // Object.is equality

[Killed] BlockStatement
src/sharing.ts:208:19
   readKey: Uint8Array,
   signKeypair: { publicKey: Uint8Array; secretKey: Uint8Array },
   recipientPubkey: Uint8Array
-): EpochKeyBundle {
-  return {
-    version: BUNDLE_VERSION,
-    albumId,
-    epochId,
-    recipientPubkey,
-    readKey,
-    signKeypair,
-  };
-}
+): EpochKeyBundle {}
 
killedBy: integration: album sharing between users owner can share epoch key with recipient
statusReason: Cannot read properties of undefined (reading 'version')
