[Killed] BlockStatement
src/signer.ts:39:15
 export function signManifest(
   manifest: Uint8Array,
   signSecretKey: Uint8Array
-): Uint8Array {
-  if (signSecretKey.length !== SECRET_KEY_LENGTH) {
-    throw new CryptoError(
-      `Signing secret key must be ${SECRET_KEY_LENGTH} bytes, got ${signSecretKey.length}`,
-      CryptoErrorCode.INVALID_KEY_LENGTH
-    );
-  }
-
-  // Domain-separate: sign(context || manifest)
-  const message = concat(MANIFEST_CONTEXT, manifest);
-  return sodium.crypto_sign_detached(message, signSecretKey);
-}
+): Uint8Array {}
 
 /**
killedBy: integration: album creation and photo upload signs and verifies manifest
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
src/signer.ts:40:7
   manifest: Uint8Array,
   signSecretKey: Uint8Array
 ): Uint8Array {
-  if (signSecretKey.length !== SECRET_KEY_LENGTH) {
+  if (signSecretKey.length === SECRET_KEY_LENGTH) {
     throw new CryptoError(
       `Signing secret key must be ${SECRET_KEY_LENGTH} bytes, got ${signSecretKey.length}`,
killedBy: integration: album creation and photo upload signs and verifies manifest
statusReason: Signing secret key must be 64 bytes, got 64

[Killed] ConditionalExpression
src/signer.ts:40:7
   manifest: Uint8Array,
   signSecretKey: Uint8Array
 ): Uint8Array {
-  if (signSecretKey.length !== SECRET_KEY_LENGTH) {
+  if (true) {
     throw new CryptoError(
       `Signing secret key must be ${SECRET_KEY_LENGTH} bytes, got ${signSecretKey.length}`,
killedBy: integration: album creation and photo upload signs and verifies manifest
statusReason: Signing secret key must be 64 bytes, got 64

[Survived] StringLiteral
src/signer.ts:42:7
 ): Uint8Array {
   if (signSecretKey.length !== SECRET_KEY_LENGTH) {
     throw new CryptoError(
-      `Signing secret key must be ${SECRET_KEY_LENGTH} bytes, got ${signSecretKey.length}`,
+      ``,
       CryptoErrorCode.INVALID_KEY_LENGTH
     );

[Killed] BlockStatement
src/signer.ts:64:12
   manifest: Uint8Array,
   signature: Uint8Array,
   signPublicKey: Uint8Array
-): boolean {
-  if (signature.length !== SIGNATURE_LENGTH) {
-    return false;
-  }
-  if (signPublicKey.length !== PUBLIC_KEY_LENGTH) {
-    return false;
-  }
-
-  try {
-    const message = concat(MANIFEST_CONTEXT, manifest);
-    return sodium.crypto_sign_verify_detached(signature, message, signPublicKey);
-  } catch {
-    return false;
-  }
-}
+): boolean {}
 
 /**
killedBy: integration: album creation and photo upload signs and verifies manifest
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/signer.ts:65:7
   signature: Uint8Array,
   signPublicKey: Uint8Array
 ): boolean {
-  if (signature.length !== SIGNATURE_LENGTH) {
+  if (true) {
     return false;
   }
killedBy: integration: album creation and photo upload signs and verifies manifest
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/signer.ts:65:7
   signature: Uint8Array,
   signPublicKey: Uint8Array
 ): boolean {
-  if (signature.length !== SIGNATURE_LENGTH) {
+  if (signature.length === SIGNATURE_LENGTH) {
     return false;
   }
killedBy: integration: album creation and photo upload signs and verifies manifest
statusReason: expected false to be true // Object.is equality

[NoCoverage] BooleanLiteral
src/signer.ts:66:12
   signPublicKey: Uint8Array
 ): boolean {
   if (signature.length !== SIGNATURE_LENGTH) {
-    return false;
+    return true;
   }
   if (signPublicKey.length !== PUBLIC_KEY_LENGTH) {

[Killed] EqualityOperator
src/signer.ts:68:7
   if (signature.length !== SIGNATURE_LENGTH) {
     return false;
   }
-  if (signPublicKey.length !== PUBLIC_KEY_LENGTH) {
+  if (signPublicKey.length === PUBLIC_KEY_LENGTH) {
     return false;
   }
killedBy: integration: album creation and photo upload signs and verifies manifest
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/signer.ts:68:7
   if (signature.length !== SIGNATURE_LENGTH) {
     return false;
   }
-  if (signPublicKey.length !== PUBLIC_KEY_LENGTH) {
+  if (true) {
     return false;
   }
killedBy: integration: album creation and photo upload signs and verifies manifest
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/signer.ts:69:12
     return false;
   }
   if (signPublicKey.length !== PUBLIC_KEY_LENGTH) {
-    return false;
+    return true;
   }
 
killedBy: signer rejects invalid key lengths
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/signer.ts:72:7
     return false;
   }
 
-  try {
-    const message = concat(MANIFEST_CONTEXT, manifest);
-    return sodium.crypto_sign_verify_detached(signature, message, signPublicKey);
-  } catch {
+  try {} catch {
     return false;
   }
killedBy: integration: album creation and photo upload signs and verifies manifest
statusReason: expected undefined to be true // Object.is equality

[NoCoverage] BlockStatement
src/signer.ts:75:11
   try {
     const message = concat(MANIFEST_CONTEXT, manifest);
     return sodium.crypto_sign_verify_detached(signature, message, signPublicKey);
-  } catch {
-    return false;
-  }
+  } catch {}
 }
 

[Killed] BlockStatement
src/signer.ts:94:15
   header: Uint8Array,
   ciphertext: Uint8Array,
   signSecretKey: Uint8Array
-): Uint8Array {
-  if (signSecretKey.length !== SECRET_KEY_LENGTH) {
-    throw new CryptoError(
-      `Signing secret key must be ${SECRET_KEY_LENGTH} bytes, got ${signSecretKey.length}`,
-      CryptoErrorCode.INVALID_KEY_LENGTH
-    );
-  }
-
-  // Domain-separate: sign(context || header || ciphertext)
-  const message = concat(SHARD_SIGN_CONTEXT, header, ciphertext);
-  return sodium.crypto_sign_detached(message, signSecretKey);
-}
+): Uint8Array {}
 
 /**
killedBy: signer shard signing produces valid signatures
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/signer.ts:121:12
   ciphertext: Uint8Array,
   signature: Uint8Array,
   signPublicKey: Uint8Array
-): boolean {
-  if (signature.length !== SIGNATURE_LENGTH) {
-    return false;
-  }
-  if (signPublicKey.length !== PUBLIC_KEY_LENGTH) {
-    return false;
-  }
-
-  try {
-    const message = concat(SHARD_SIGN_CONTEXT, header, ciphertext);
-    return sodium.crypto_sign_verify_detached(signature, message, signPublicKey);
-  } catch {
-    return false;
-  }
-}
+): boolean {}
 
 /**
killedBy: signer shard signing produces valid signatures
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/signer.ts:129:7
     return false;
   }
 
-  try {
-    const message = concat(SHARD_SIGN_CONTEXT, header, ciphertext);
-    return sodium.crypto_sign_verify_detached(signature, message, signPublicKey);
-  } catch {
+  try {} catch {
     return false;
   }
killedBy: signer shard signing produces valid signatures
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/signer.ts:150:15
   data: Uint8Array,
   context: string,
   signSecretKey: Uint8Array
-): Uint8Array {
-  if (signSecretKey.length !== SECRET_KEY_LENGTH) {
-    throw new CryptoError(
-      `Signing secret key must be ${SECRET_KEY_LENGTH} bytes, got ${signSecretKey.length}`,
-      CryptoErrorCode.INVALID_KEY_LENGTH
-    );
-  }
-
-  const message = concat(toBytes(context), data);
-  return sodium.crypto_sign_detached(message, signSecretKey);
-}
+): Uint8Array {}
 
 /**
killedBy: signer context signing works with custom context
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/signer.ts:176:12
   signature: Uint8Array,
   context: string,
   signPublicKey: Uint8Array
-): boolean {
-  if (signature.length !== SIGNATURE_LENGTH) {
-    return false;
-  }
-  if (signPublicKey.length !== PUBLIC_KEY_LENGTH) {
-    return false;
-  }
-
-  try {
-    const message = concat(toBytes(context), data);
-    return sodium.crypto_sign_verify_detached(signature, message, signPublicKey);
-  } catch {
-    return false;
-  }
-}
+): boolean {}
 
killedBy: signer context signing works with custom context
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/signer.ts:184:7
     return false;
   }
 
-  try {
-    const message = concat(toBytes(context), data);
-    return sodium.crypto_sign_verify_detached(signature, message, signPublicKey);
-  } catch {
+  try {} catch {
     return false;
   }
killedBy: signer context signing works with custom context
statusReason: expected undefined to be true // Object.is equality
