[Killed] BlockStatement
src/utils.ts:15:61
  * @param arrays - Arrays to concatenate
  * @returns Combined array
  */
-export function concat(...arrays: Uint8Array[]): Uint8Array {
-  const totalLength = arrays.reduce((sum, arr) => sum + arr.length, 0);
-  const result = new Uint8Array(totalLength);
-  let offset = 0;
-  for (const arr of arrays) {
-    result.set(arr, offset);
-    offset += arr.length;
-  }
-  return result;
-}
+export function concat(...arrays: Uint8Array[]): Uint8Array {}
 
 /**
killedBy: integration: album creation and photo upload signs and verifies manifest
statusReason: message cannot be null or undefined

[Killed] ArrowFunction
src/utils.ts:16:37
  * @returns Combined array
  */
 export function concat(...arrays: Uint8Array[]): Uint8Array {
-  const totalLength = arrays.reduce((sum, arr) => sum + arr.length, 0);
+  const totalLength = arrays.reduce(() => undefined, 0);
   const result = new Uint8Array(totalLength);
   let offset = 0;
killedBy: integration: album creation and photo upload signs and verifies manifest
statusReason: offset is out of bounds

[Killed] ArithmeticOperator
src/utils.ts:16:51
  * @returns Combined array
  */
 export function concat(...arrays: Uint8Array[]): Uint8Array {
-  const totalLength = arrays.reduce((sum, arr) => sum + arr.length, 0);
+  const totalLength = arrays.reduce((sum, arr) => sum - arr.length, 0);
   const result = new Uint8Array(totalLength);
   let offset = 0;
killedBy: integration: album creation and photo upload signs and verifies manifest
statusReason: Invalid typed array length: -136

[Killed] BlockStatement
src/utils.ts:19:29
   const totalLength = arrays.reduce((sum, arr) => sum + arr.length, 0);
   const result = new Uint8Array(totalLength);
   let offset = 0;
-  for (const arr of arrays) {
-    result.set(arr, offset);
-    offset += arr.length;
-  }
+  for (const arr of arrays) {}
   return result;
 }
killedBy: integration: album creation and photo upload signs and verifies manifest
statusReason: expected true to be false // Object.is equality

[Killed] AssignmentOperator
src/utils.ts:21:5
   let offset = 0;
   for (const arr of arrays) {
     result.set(arr, offset);
-    offset += arr.length;
+    offset -= arr.length;
   }
   return result;
killedBy: integration: album creation and photo upload signs and verifies manifest
statusReason: offset is out of bounds

[Killed] BlockStatement
src/utils.ts:34:74
  * @param b - Second array
  * @returns true if equal
  */
-export function constantTimeEqual(a: Uint8Array, b: Uint8Array): boolean {
-  if (a.length !== b.length) {
-    return false;
-  }
-  // sodium.compare returns 0 if equal, -1 or 1 if not
-  return sodium.compare(a, b) === 0;
-}
+export function constantTimeEqual(a: Uint8Array, b: Uint8Array): boolean {}
 
 /**
killedBy: utils constantTimeEqual returns true for equal arrays
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/utils.ts:35:30
  * @returns true if equal
  */
 export function constantTimeEqual(a: Uint8Array, b: Uint8Array): boolean {
-  if (a.length !== b.length) {
-    return false;
-  }
+  if (a.length !== b.length) {}
   // sodium.compare returns 0 if equal, -1 or 1 if not
   return sodium.compare(a, b) === 0;
killedBy: utils constantTimeEqual returns false for different lengths
statusReason: Only instances of identical length can be compared

[Killed] ConditionalExpression
src/utils.ts:35:7
  * @returns true if equal
  */
 export function constantTimeEqual(a: Uint8Array, b: Uint8Array): boolean {
-  if (a.length !== b.length) {
+  if (true) {
     return false;
   }
killedBy: utils constantTimeEqual returns true for equal arrays
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/utils.ts:39:10
     return false;
   }
   // sodium.compare returns 0 if equal, -1 or 1 if not
-  return sodium.compare(a, b) === 0;
+  return sodium.compare(a, b) !== 0;
 }
 
killedBy: utils constantTimeEqual returns true for equal arrays
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utils.ts:39:10
     return false;
   }
   // sodium.compare returns 0 if equal, -1 or 1 if not
-  return sodium.compare(a, b) === 0;
+  return true;
 }
 
killedBy: utils constantTimeEqual returns false for different arrays
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/utils.ts:48:65
  * @param data - Data to hash
  * @returns Hash as base64url string (no padding)
  */
-export async function sha256(data: Uint8Array): Promise<string> {
-  // Copy to new ArrayBuffer to satisfy crypto.subtle.digest type requirements
-  const buffer = new ArrayBuffer(data.length);
-  new Uint8Array(buffer).set(data);
-  const hashBuffer = await crypto.subtle.digest('SHA-256', buffer);
-  return sodium.to_base64(
-    new Uint8Array(hashBuffer),
-    sodium.base64_variants.URLSAFE_NO_PADDING
-  );
-}
+export async function sha256(data: Uint8Array): Promise<string> {}
 
 /**
killedBy: integration: album creation and photo upload encrypts multiple shards for a large photo
statusReason: expected 1 to be 3 // Object.is equality

[Killed] StringLiteral
src/utils.ts:52:49
   // Copy to new ArrayBuffer to satisfy crypto.subtle.digest type requirements
   const buffer = new ArrayBuffer(data.length);
   new Uint8Array(buffer).set(data);
-  const hashBuffer = await crypto.subtle.digest('SHA-256', buffer);
+  const hashBuffer = await crypto.subtle.digest("", buffer);
   return sodium.to_base64(
     new Uint8Array(hashBuffer),
killedBy: integration: album creation and photo upload encrypts and decrypts photo shards
statusReason: Unrecognized algorithm name

[Survived] BlockStatement
src/utils.ts:66:54
  * @param data - Data to hash
  * @returns Hash as base64url string (no padding)
  */
-export function sha256Sync(data: Uint8Array): string {
-  const hash = sodium.crypto_generichash(32, data);
-  return sodium.to_base64(hash, sodium.base64_variants.URLSAFE_NO_PADDING);
-}
+export function sha256Sync(data: Uint8Array): string {}
 
 /**

[Killed] BlockStatement
src/utils.ts:76:51
  *
  * @param buffer - Buffer to zero
  */
-export function memzero(buffer: Uint8Array): void {
-  sodium.memzero(buffer);
-}
+export function memzero(buffer: Uint8Array): void {}
 
 /**
killedBy: utils memzero zeros buffer contents
statusReason: expected Uint8Array[ 1, 2, 3, 4 ] to deeply equal Uint8Array[ 0, 0, 0, 0 ]

[Killed] BlockStatement
src/utils.ts:86:57
  * @param length - Number of bytes to generate
  * @returns Random bytes
  */
-export function randomBytes(length: number): Uint8Array {
-  return sodium.randombytes_buf(length);
-}
+export function randomBytes(length: number): Uint8Array {}
 
 /**
killedBy: integration: user registration flow derives and unwraps consistent account key
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/utils.ts:96:52
  * @param data - Bytes to encode
  * @returns Base64url string
  */
-export function toBase64(data: Uint8Array): string {
-  return sodium.to_base64(data, sodium.base64_variants.URLSAFE_NO_PADDING);
-}
+export function toBase64(data: Uint8Array): string {}
 
 /**
killedBy: integration: album sharing between users owner can share epoch key with recipient
statusReason: input cannot be null or undefined

[Killed] BlockStatement
src/utils.ts:106:56
  * @param base64 - Base64url string (with or without padding)
  * @returns Decoded bytes
  */
-export function fromBase64(base64: string): Uint8Array {
-  return sodium.from_base64(base64, sodium.base64_variants.URLSAFE_NO_PADDING);
-}
+export function fromBase64(base64: string): Uint8Array {}
 
 /**
killedBy: integration: album sharing between users owner can share epoch key with recipient
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/utils.ts:116:50
  * @param str - String to encode
  * @returns UTF-8 bytes
  */
-export function toBytes(str: string): Uint8Array {
-  return new TextEncoder().encode(str);
-}
+export function toBytes(str: string): Uint8Array {}
 
 /**
killedBy: integration: album creation and photo upload signs and verifies manifest
statusReason: Cannot read properties of undefined (reading 'length')

[NoCoverage] BlockStatement
src/utils.ts:126:54
  * @param bytes - Bytes to decode
  * @returns Decoded string
  */
-export function fromBytes(bytes: Uint8Array): string {
-  return new TextDecoder().decode(bytes);
-}
+export function fromBytes(bytes: Uint8Array): string {}
 
