[Killed] BlockStatement
src/epochs.ts:20:61
  * @param epochId - Epoch identifier (increments on key rotation)
  * @returns New epoch key with ReadKey and SignKeypair
  */
-export function generateEpochKey(epochId: number): EpochKey {
-  // Generate random read key for content encryption
-  const readKey = randomBytes(KEY_SIZE);
-
-  // Generate Ed25519 keypair for manifest signing
-  const signKeypair = sodium.crypto_sign_keypair();
-
-  return {
-    epochId,
-    readKey,
-    signKeypair: {
-      publicKey: signKeypair.publicKey,
-      secretKey: signKeypair.privateKey,
-    },
-  };
-}
+export function generateEpochKey(epochId: number): EpochKey {}
 
 /**
killedBy: integration: album creation and photo upload encrypts and decrypts photo shards
statusReason: Cannot read properties of undefined (reading 'readKey')

[Killed] BlockStatement
src/epochs.ts:47:3
 export function serializeEpochKeyPublic(epochKey: EpochKey): {
   epochId: number;
   signPublicKey: string;
-} {
-  return {
-    epochId: epochKey.epochId,
-    signPublicKey: sodium.to_base64(
-      epochKey.signKeypair.publicKey,
-      sodium.base64_variants.URLSAFE_NO_PADDING
-    ),
-  };
-}
+} {}
 
 /**
killedBy: epochs serializes epoch key public info
statusReason: Cannot read properties of undefined (reading 'epochId')

[Killed] ObjectLiteral
src/epochs.ts:48:10
   epochId: number;
   signPublicKey: string;
 } {
-  return {
-    epochId: epochKey.epochId,
-    signPublicKey: sodium.to_base64(
-      epochKey.signKeypair.publicKey,
-      sodium.base64_variants.URLSAFE_NO_PADDING
-    ),
-  };
+  return {};
 }
 
killedBy: epochs serializes epoch key public info
statusReason: expected undefined to be 5 // Object.is equality

[Killed] BlockStatement
src/epochs.ts:74:3
   epochId: number;
   signPublicKey: Uint8Array;
   wrapped: Uint8Array;
-} {
-  // Wrap the read key
-  const wrappedReadKey = wrapKey(epochKey.readKey, wrapper);
-
-  // Wrap the signing secret key
-  const wrappedSignSecret = wrapKey(epochKey.signKeypair.secretKey, wrapper);
-
-  // Combine: length(2) || wrappedReadKey || wrappedSignSecret
-  const wrapped = new Uint8Array(2 + wrappedReadKey.length + wrappedSignSecret.length);
-  const view = new DataView(wrapped.buffer);
-  view.setUint16(0, wrappedReadKey.length, true);
-  wrapped.set(wrappedReadKey, 2);
-  wrapped.set(wrappedSignSecret, 2 + wrappedReadKey.length);
-
-  return {
-    epochId: epochKey.epochId,
-    signPublicKey: epochKey.signKeypair.publicKey,
-    wrapped,
-  };
-}
+} {}
 
 /**
killedBy: epochs round-trips wrap/unwrap
statusReason: Cannot read properties of undefined (reading 'epochId')

[Killed] ArithmeticOperator
src/epochs.ts:82:34
   const wrappedSignSecret = wrapKey(epochKey.signKeypair.secretKey, wrapper);
 
   // Combine: length(2) || wrappedReadKey || wrappedSignSecret
-  const wrapped = new Uint8Array(2 + wrappedReadKey.length + wrappedSignSecret.length);
+  const wrapped = new Uint8Array(2 + wrappedReadKey.length - wrappedSignSecret.length);
   const view = new DataView(wrapped.buffer);
   view.setUint16(0, wrappedReadKey.length, true);
killedBy: epochs round-trips wrap/unwrap
statusReason: Invalid typed array length: -30

[Killed] ArithmeticOperator
src/epochs.ts:82:34
   const wrappedSignSecret = wrapKey(epochKey.signKeypair.secretKey, wrapper);
 
   // Combine: length(2) || wrappedReadKey || wrappedSignSecret
-  const wrapped = new Uint8Array(2 + wrappedReadKey.length + wrappedSignSecret.length);
+  const wrapped = new Uint8Array(2 - wrappedReadKey.length + wrappedSignSecret.length);
   const view = new DataView(wrapped.buffer);
   view.setUint16(0, wrappedReadKey.length, true);
killedBy: epochs round-trips wrap/unwrap
statusReason: offset is out of bounds

[Killed] BooleanLiteral
src/epochs.ts:84:44
   // Combine: length(2) || wrappedReadKey || wrappedSignSecret
   const wrapped = new Uint8Array(2 + wrappedReadKey.length + wrappedSignSecret.length);
   const view = new DataView(wrapped.buffer);
-  view.setUint16(0, wrappedReadKey.length, true);
+  view.setUint16(0, wrappedReadKey.length, false);
   wrapped.set(wrappedReadKey, 2);
   wrapped.set(wrappedSignSecret, 2 + wrappedReadKey.length);
killedBy: epochs round-trips wrap/unwrap
statusReason: Failed to unwrap key - authentication failed

[Killed] ArithmeticOperator
src/epochs.ts:86:34
   const view = new DataView(wrapped.buffer);
   view.setUint16(0, wrappedReadKey.length, true);
   wrapped.set(wrappedReadKey, 2);
-  wrapped.set(wrappedSignSecret, 2 + wrappedReadKey.length);
+  wrapped.set(wrappedSignSecret, 2 - wrappedReadKey.length);
 
   return {
killedBy: epochs round-trips wrap/unwrap
statusReason: offset is out of bounds

[Killed] BlockStatement
src/epochs.ts:109:13
   signPublicKey: Uint8Array,
   wrapped: Uint8Array,
   wrapper: Uint8Array
-): EpochKey {
-  const view = new DataView(wrapped.buffer, wrapped.byteOffset);
-  const readKeyLen = view.getUint16(0, true);
-
-  const wrappedReadKey = wrapped.slice(2, 2 + readKeyLen);
-  const wrappedSignSecret = wrapped.slice(2 + readKeyLen);
-
-  const readKey = unwrapKey(wrappedReadKey, wrapper);
-  const signSecretKey = unwrapKey(wrappedSignSecret, wrapper);
-
-  return {
-    epochId,
-    readKey,
-    signKeypair: {
-      publicKey: signPublicKey,
-      secretKey: signSecretKey,
-    },
-  };
-}
+): EpochKey {}
 
 /**
killedBy: epochs round-trips wrap/unwrap
statusReason: Cannot read properties of undefined (reading 'epochId')

[Killed] BooleanLiteral
src/epochs.ts:111:40
   wrapper: Uint8Array
 ): EpochKey {
   const view = new DataView(wrapped.buffer, wrapped.byteOffset);
-  const readKeyLen = view.getUint16(0, true);
+  const readKeyLen = view.getUint16(0, false);
 
   const wrappedReadKey = wrapped.slice(2, 2 + readKeyLen);
killedBy: epochs round-trips wrap/unwrap
statusReason: Failed to unwrap key - authentication failed

[Killed] ArithmeticOperator
src/epochs.ts:113:43
   const view = new DataView(wrapped.buffer, wrapped.byteOffset);
   const readKeyLen = view.getUint16(0, true);
 
-  const wrappedReadKey = wrapped.slice(2, 2 + readKeyLen);
+  const wrappedReadKey = wrapped.slice(2, 2 - readKeyLen);
   const wrappedSignSecret = wrapped.slice(2 + readKeyLen);
 
killedBy: epochs round-trips wrap/unwrap
statusReason: Failed to unwrap key - authentication failed

[Killed] MethodExpression
src/epochs.ts:113:26
   const view = new DataView(wrapped.buffer, wrapped.byteOffset);
   const readKeyLen = view.getUint16(0, true);
 
-  const wrappedReadKey = wrapped.slice(2, 2 + readKeyLen);
+  const wrappedReadKey = wrapped;
   const wrappedSignSecret = wrapped.slice(2 + readKeyLen);
 
killedBy: epochs round-trips wrap/unwrap
statusReason: Failed to unwrap key - authentication failed

[Killed] ArithmeticOperator
src/epochs.ts:114:43
   const readKeyLen = view.getUint16(0, true);
 
   const wrappedReadKey = wrapped.slice(2, 2 + readKeyLen);
-  const wrappedSignSecret = wrapped.slice(2 + readKeyLen);
+  const wrappedSignSecret = wrapped.slice(2 - readKeyLen);
 
   const readKey = unwrapKey(wrappedReadKey, wrapper);
killedBy: epochs round-trips wrap/unwrap
statusReason: Failed to unwrap key - authentication failed

[Killed] MethodExpression
src/epochs.ts:114:29
   const readKeyLen = view.getUint16(0, true);
 
   const wrappedReadKey = wrapped.slice(2, 2 + readKeyLen);
-  const wrappedSignSecret = wrapped.slice(2 + readKeyLen);
+  const wrappedSignSecret = wrapped;
 
   const readKey = unwrapKey(wrappedReadKey, wrapper);
killedBy: epochs round-trips wrap/unwrap
statusReason: Failed to unwrap key - authentication failed

[Killed] BlockStatement
src/epochs.ts:136:66
  * @param currentEpoch - Current epoch key
  * @returns New epoch key with incremented epochId
  */
-export function rotateEpochKey(currentEpoch: EpochKey): EpochKey {
-  return generateEpochKey(currentEpoch.epochId + 1);
-}
+export function rotateEpochKey(currentEpoch: EpochKey): EpochKey {}
 
 /**
killedBy: epochs rotates epoch with incremented id
statusReason: Cannot read properties of undefined (reading 'epochId')

[Killed] ArithmeticOperator
src/epochs.ts:137:27
  * @returns New epoch key with incremented epochId
  */
 export function rotateEpochKey(currentEpoch: EpochKey): EpochKey {
-  return generateEpochKey(currentEpoch.epochId + 1);
+  return generateEpochKey(currentEpoch.epochId - 1);
 }
 
killedBy: epochs rotates epoch with incremented id
statusReason: expected 2 to be 4 // Object.is equality

[Killed] BlockStatement
src/epochs.ts:146:62
  * @param epochKey - Epoch key to validate
  * @returns true if valid
  */
-export function isValidEpochKey(epochKey: EpochKey): boolean {
-  if (typeof epochKey.epochId !== 'number' || epochKey.epochId < 0) {
-    return false;
-  }
-
-  if (epochKey.readKey.length !== KEY_SIZE) {
-    return false;
-  }
-
-  if (epochKey.signKeypair.publicKey.length !== 32) {
-    return false;
-  }
-
-  if (epochKey.signKeypair.secretKey.length !== 64) {
-    return false;
-  }
-
-  return true;
-}
+export function isValidEpochKey(epochKey: EpochKey): boolean {}
 
killedBy: epochs generates valid epoch keys
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/epochs.ts:147:7
  * @returns true if valid
  */
 export function isValidEpochKey(epochKey: EpochKey): boolean {
-  if (typeof epochKey.epochId !== 'number' || epochKey.epochId < 0) {
+  if (false) {
     return false;
   }
killedBy: epochs validates epoch key structure
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/epochs.ts:147:69
  * @returns true if valid
  */
 export function isValidEpochKey(epochKey: EpochKey): boolean {
-  if (typeof epochKey.epochId !== 'number' || epochKey.epochId < 0) {
-    return false;
-  }
+  if (typeof epochKey.epochId !== 'number' || epochKey.epochId < 0) {}
 
   if (epochKey.readKey.length !== KEY_SIZE) {
killedBy: epochs validates epoch key structure
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/epochs.ts:148:12
  */
 export function isValidEpochKey(epochKey: EpochKey): boolean {
   if (typeof epochKey.epochId !== 'number' || epochKey.epochId < 0) {
-    return false;
+    return true;
   }
 
killedBy: epochs validates epoch key structure
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/epochs.ts:151:7
     return false;
   }
 
-  if (epochKey.readKey.length !== KEY_SIZE) {
+  if (false) {
     return false;
   }
killedBy: epochs validates epoch key structure
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/epochs.ts:151:7
     return false;
   }
 
-  if (epochKey.readKey.length !== KEY_SIZE) {
+  if (true) {
     return false;
   }
killedBy: epochs generates valid epoch keys
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/epochs.ts:152:12
   }
 
   if (epochKey.readKey.length !== KEY_SIZE) {
-    return false;
+    return true;
   }
 
killedBy: epochs validates epoch key structure
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/epochs.ts:155:7
     return false;
   }
 
-  if (epochKey.signKeypair.publicKey.length !== 32) {
+  if (true) {
     return false;
   }
killedBy: epochs generates valid epoch keys
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/epochs.ts:155:7
     return false;
   }
 
-  if (epochKey.signKeypair.publicKey.length !== 32) {
+  if (epochKey.signKeypair.publicKey.length === 32) {
     return false;
   }
killedBy: epochs generates valid epoch keys
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/epochs.ts:156:12
   }
 
   if (epochKey.signKeypair.publicKey.length !== 32) {
-    return false;
+    return true;
   }
 
killedBy: epochs validates epoch key structure
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/epochs.ts:159:7
     return false;
   }
 
-  if (epochKey.signKeypair.secretKey.length !== 64) {
+  if (true) {
     return false;
   }
killedBy: epochs generates valid epoch keys
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/epochs.ts:159:7
     return false;
   }
 
-  if (epochKey.signKeypair.secretKey.length !== 64) {
+  if (false) {
     return false;
   }
killedBy: epochs validates epoch key structure
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/epochs.ts:160:12
   }
 
   if (epochKey.signKeypair.secretKey.length !== 64) {
-    return false;
+    return true;
   }
 
killedBy: epochs validates epoch key structure
statusReason: expected true to be false // Object.is equality
