[Survived] ArithmeticOperator
src/keybox.ts:12:28
 import { CryptoError, CryptoErrorCode, KEY_SIZE, NONCE_SIZE, TAG_SIZE } from './types';
 
 /** Minimum wrapped key length: nonce (24) + tag (16) + at least 1 byte */
-const MIN_WRAPPED_LENGTH = NONCE_SIZE + TAG_SIZE + 1;
+const MIN_WRAPPED_LENGTH = NONCE_SIZE + TAG_SIZE - 1;
 
 /**

[Survived] ArithmeticOperator
src/keybox.ts:12:28
 import { CryptoError, CryptoErrorCode, KEY_SIZE, NONCE_SIZE, TAG_SIZE } from './types';
 
 /** Minimum wrapped key length: nonce (24) + tag (16) + at least 1 byte */
-const MIN_WRAPPED_LENGTH = NONCE_SIZE + TAG_SIZE + 1;
+const MIN_WRAPPED_LENGTH = NONCE_SIZE - TAG_SIZE + 1;
 
 /**

[Killed] BlockStatement
src/keybox.ts:25:75
  * @returns Wrapped key bytes
  * @throws CryptoError if wrapper key is not 32 bytes
  */
-export function wrapKey(key: Uint8Array, wrapper: Uint8Array): Uint8Array {
-  if (wrapper.length !== KEY_SIZE) {
-    throw new CryptoError(
-      `Wrapper key must be ${KEY_SIZE} bytes, got ${wrapper.length}`,
-      CryptoErrorCode.INVALID_KEY_LENGTH
-    );
-  }
-
-  // Generate fresh random nonce - CRITICAL for security
-  const nonce = sodium.randombytes_buf(NONCE_SIZE);
-
-  // Encrypt with XChaCha20-Poly1305 (secretbox uses this internally)
-  const ciphertext = sodium.crypto_secretbox_easy(key, nonce, wrapper);
-
-  // Prepend nonce to ciphertext
-  const result = new Uint8Array(NONCE_SIZE + ciphertext.length);
-  result.set(nonce, 0);
-  result.set(ciphertext, NONCE_SIZE);
-
-  return result;
-}
+export function wrapKey(key: Uint8Array, wrapper: Uint8Array): Uint8Array {}
 
 /**
killedBy: epochs round-trips wrap/unwrap
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
src/keybox.ts:26:7
  * @throws CryptoError if wrapper key is not 32 bytes
  */
 export function wrapKey(key: Uint8Array, wrapper: Uint8Array): Uint8Array {
-  if (wrapper.length !== KEY_SIZE) {
+  if (wrapper.length === KEY_SIZE) {
     throw new CryptoError(
       `Wrapper key must be ${KEY_SIZE} bytes, got ${wrapper.length}`,
killedBy: epochs round-trips wrap/unwrap
statusReason: Wrapper key must be 32 bytes, got 32

[Killed] ConditionalExpression
src/keybox.ts:26:7
  * @throws CryptoError if wrapper key is not 32 bytes
  */
 export function wrapKey(key: Uint8Array, wrapper: Uint8Array): Uint8Array {
-  if (wrapper.length !== KEY_SIZE) {
+  if (true) {
     throw new CryptoError(
       `Wrapper key must be ${KEY_SIZE} bytes, got ${wrapper.length}`,
killedBy: epochs round-trips wrap/unwrap
statusReason: Wrapper key must be 32 bytes, got 32

[Survived] StringLiteral
src/keybox.ts:28:7
 export function wrapKey(key: Uint8Array, wrapper: Uint8Array): Uint8Array {
   if (wrapper.length !== KEY_SIZE) {
     throw new CryptoError(
-      `Wrapper key must be ${KEY_SIZE} bytes, got ${wrapper.length}`,
+      ``,
       CryptoErrorCode.INVALID_KEY_LENGTH
     );

[Killed] ArithmeticOperator
src/keybox.ts:40:33
   const ciphertext = sodium.crypto_secretbox_easy(key, nonce, wrapper);
 
   // Prepend nonce to ciphertext
-  const result = new Uint8Array(NONCE_SIZE + ciphertext.length);
+  const result = new Uint8Array(NONCE_SIZE - ciphertext.length);
   result.set(nonce, 0);
   result.set(ciphertext, NONCE_SIZE);
killedBy: epochs round-trips wrap/unwrap
statusReason: Invalid typed array length: -24

[Killed] EqualityOperator
src/keybox.ts:56:7
  * @throws CryptoError if decryption fails or inputs are invalid
  */
 export function unwrapKey(wrapped: Uint8Array, wrapper: Uint8Array): Uint8Array {
-  if (wrapper.length !== KEY_SIZE) {
+  if (wrapper.length === KEY_SIZE) {
     throw new CryptoError(
       `Wrapper key must be ${KEY_SIZE} bytes, got ${wrapper.length}`,
killedBy: epochs round-trips wrap/unwrap
statusReason: Wrapper key must be 32 bytes, got 32

[Killed] ConditionalExpression
src/keybox.ts:56:7
  * @throws CryptoError if decryption fails or inputs are invalid
  */
 export function unwrapKey(wrapped: Uint8Array, wrapper: Uint8Array): Uint8Array {
-  if (wrapper.length !== KEY_SIZE) {
+  if (true) {
     throw new CryptoError(
       `Wrapper key must be ${KEY_SIZE} bytes, got ${wrapper.length}`,
killedBy: epochs round-trips wrap/unwrap
statusReason: Wrapper key must be 32 bytes, got 32

[Killed] ConditionalExpression
src/keybox.ts:63:7
     );
   }
 
-  if (wrapped.length < MIN_WRAPPED_LENGTH) {
+  if (true) {
     throw new CryptoError(
       `Wrapped key too short: ${wrapped.length} bytes, minimum ${MIN_WRAPPED_LENGTH}`,
killedBy: epochs round-trips wrap/unwrap
statusReason: Wrapped key too short: 72 bytes, minimum 41

[Killed] EqualityOperator
src/keybox.ts:63:7
     );
   }
 
-  if (wrapped.length < MIN_WRAPPED_LENGTH) {
+  if (wrapped.length >= MIN_WRAPPED_LENGTH) {
     throw new CryptoError(
       `Wrapped key too short: ${wrapped.length} bytes, minimum ${MIN_WRAPPED_LENGTH}`,
killedBy: epochs round-trips wrap/unwrap
statusReason: Wrapped key too short: 72 bytes, minimum 41

[Killed] MethodExpression
src/keybox.ts:70:17
     );
   }
 
-  const nonce = wrapped.slice(0, NONCE_SIZE);
+  const nonce = wrapped;
   const ciphertext = wrapped.slice(NONCE_SIZE);
 
killedBy: epochs round-trips wrap/unwrap
statusReason: Failed to unwrap key - authentication failed

[Killed] MethodExpression
src/keybox.ts:71:22
   }
 
   const nonce = wrapped.slice(0, NONCE_SIZE);
-  const ciphertext = wrapped.slice(NONCE_SIZE);
+  const ciphertext = wrapped;
 
   try {
killedBy: keybox round-trips wrap/unwrap
statusReason: Failed to unwrap key - authentication failed

[Killed] BlockStatement
src/keybox.ts:73:7
   const nonce = wrapped.slice(0, NONCE_SIZE);
   const ciphertext = wrapped.slice(NONCE_SIZE);
 
-  try {
-    const plaintext = sodium.crypto_secretbox_open_easy(ciphertext, nonce, wrapper);
-    return plaintext;
-  } catch {
+  try {} catch {
     throw new CryptoError(
       'Failed to unwrap key - authentication failed',
killedBy: epochs round-trips wrap/unwrap
statusReason: expected undefined to deeply equal Uint8Array[ 163, 112, 182, 59, …(-114) ]

[Killed] BlockStatement
src/keybox.ts:76:11
   try {
     const plaintext = sodium.crypto_secretbox_open_easy(ciphertext, nonce, wrapper);
     return plaintext;
-  } catch {
-    throw new CryptoError(
-      'Failed to unwrap key - authentication failed',
-      CryptoErrorCode.DECRYPTION_FAILED
-    );
-  }
+  } catch {}
 }
 
killedBy: keybox fails unwrap with wrong wrapper key
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/keybox.ts:92:84
  * @param wrapper - Wrapping key (32 bytes)
  * @returns Wrapped key bytes
  */
-export function wrapSymmetricKey(key: Uint8Array, wrapper: Uint8Array): Uint8Array {
-  if (key.length !== KEY_SIZE) {
-    throw new CryptoError(
-      `Key must be ${KEY_SIZE} bytes, got ${key.length}`,
-      CryptoErrorCode.INVALID_KEY_LENGTH
-    );
-  }
-  return wrapKey(key, wrapper);
-}
+export function wrapSymmetricKey(key: Uint8Array, wrapper: Uint8Array): Uint8Array {}
 
 /**
killedBy: keybox symmetric key helpers validates key length on wrap
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/keybox.ts:93:7
  * @returns Wrapped key bytes
  */
 export function wrapSymmetricKey(key: Uint8Array, wrapper: Uint8Array): Uint8Array {
-  if (key.length !== KEY_SIZE) {
+  if (false) {
     throw new CryptoError(
       `Key must be ${KEY_SIZE} bytes, got ${key.length}`,
killedBy: keybox symmetric key helpers validates key length on wrap
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/keybox.ts:93:7
  * @returns Wrapped key bytes
  */
 export function wrapSymmetricKey(key: Uint8Array, wrapper: Uint8Array): Uint8Array {
-  if (key.length !== KEY_SIZE) {
+  if (key.length === KEY_SIZE) {
     throw new CryptoError(
       `Key must be ${KEY_SIZE} bytes, got ${key.length}`,
killedBy: keybox symmetric key helpers validates key length on wrap
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/keybox.ts:110:90
  * @param wrapper - Wrapping key (32 bytes)
  * @returns Unwrapped key (32 bytes)
  */
-export function unwrapSymmetricKey(wrapped: Uint8Array, wrapper: Uint8Array): Uint8Array {
-  const key = unwrapKey(wrapped, wrapper);
-  if (key.length !== KEY_SIZE) {
-    throw new CryptoError(
-      `Unwrapped key expected to be ${KEY_SIZE} bytes, got ${key.length}`,
-      CryptoErrorCode.INVALID_KEY_LENGTH
-    );
-  }
-  return key;
-}
+export function unwrapSymmetricKey(wrapped: Uint8Array, wrapper: Uint8Array): Uint8Array {}
 
killedBy: keybox symmetric key helpers validates unwrapped key length
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/keybox.ts:112:7
  */
 export function unwrapSymmetricKey(wrapped: Uint8Array, wrapper: Uint8Array): Uint8Array {
   const key = unwrapKey(wrapped, wrapper);
-  if (key.length !== KEY_SIZE) {
+  if (key.length === KEY_SIZE) {
     throw new CryptoError(
       `Unwrapped key expected to be ${KEY_SIZE} bytes, got ${key.length}`,
killedBy: keybox symmetric key helpers validates unwrapped key length
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/keybox.ts:112:32
  */
 export function unwrapSymmetricKey(wrapped: Uint8Array, wrapper: Uint8Array): Uint8Array {
   const key = unwrapKey(wrapped, wrapper);
-  if (key.length !== KEY_SIZE) {
-    throw new CryptoError(
-      `Unwrapped key expected to be ${KEY_SIZE} bytes, got ${key.length}`,
-      CryptoErrorCode.INVALID_KEY_LENGTH
-    );
-  }
+  if (key.length !== KEY_SIZE) {}
   return key;
 }
killedBy: keybox symmetric key helpers validates unwrapped key length
statusReason: expected [Function] to throw an error
